[{"data":1,"prerenderedAt":63},["Reactive",2],{"/blog/beyond-pastels-and-tremolos":3,"content-query-Tm49v6F6BT":46},{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":7,"title":8,"description":9,"subtitle":10,"author":11,"slug":12,"image":13,"alt":14,"attribution":11,"publishedDate":15,"updatedAt":15,"length":16,"wordCount":17,"body":18,"_type":41,"_id":42,"_source":43,"_file":44,"_extension":45},"/blog/beyond-pastels-and-tremolos","blog",false,"","Beyond Pastels and Tremolos","While only 29 years of age, at times, it feels like I’ve surmounted three lifetimes’ worth of creative exploration already.","My newfound love for the written word","Kilian Kukelka","/beyond-pastels-and-tremolos","beyond-pastels-and-tremolos","Minimal writing setup","2023-10-12",2,476,{"type":19,"children":20,"toc":39},"root",[21,29,34],{"type":22,"tag":23,"props":24,"children":25},"element","p",{},[26],{"type":27,"value":28},"text","While only 29 years of age, at times, it feels like I’ve surmounted three lifetimes’ worth of creative exploration already. This all thanks to my most curious and indecisive nature, making life appear as if it were an all-inclusive buffet, presenting me with a myriad of delicacies I have yet to indulge in. From the humble beginnings of me wanting to become a composer for TV and film, to my unavailing odyssey through the mysterious realms of painting, it is now that I find myself sitting here at my desk, with nothing but a pen and a blank piece of paper lying in front of me. I assume it’s this very simplicity, the ease with which one is able to engage with the craft, that ultimately drew me to field of writing.",{"type":22,"tag":23,"props":30,"children":31},{},[32],{"type":27,"value":33},"Gone were the days of patiently tuning the strings on my guitar, meticulously cleaning paint brushes with brain-fog-inducing solvents, soundproofing the interior of my bedroom to get rid of its echo-y sound, spendings days of research on what type of microphone to buy or which brand of oil colors to pour my money into. Unlike its rather demanding siblings, the medium of writing is surprisingly easy to please. As long as you have a pulse and bring along some basic knowledge of the English grammar, you are free to express whatever you deem worthwhile. Whether I am doing my laundry or waiting in line at the grocery store, its omnipresence accompanies my every waking moment. Being able to revise and refine my stories within the comfort of my own head poses an unparalleled level of creative freedom that defies the rules and constraints of the physical world.",{"type":22,"tag":23,"props":35,"children":36},{},[37],{"type":27,"value":38},"With this newfound love for the written word, also emerged an appreciation for the plethora of concepts and ideas that spring from our imagination. My inner dialogues have become more than mere fleeting thoughts. Something precious — something to cherish — something that I must hold on to at all costs. I now find myself in obeisance to a higher power, urging me to transcribe, document, and collect any crumb of inspiration life chooses to throw my way. So much so, that I do not dare to leave my apartment without carrying some sort of notebook with me. Scattered across my room, pages upon pages filled with unfinished short stories and uncharted narratives. Hundreds of hastily-typed notes collecting virtual dust on my phone. While every now and then, this compulsion of mine can feel somewhat burdensome and exhausting, given a society of excess and overabundance, what more could one ask for than a sense of necessity? When a particular constellation of words or a most poignant way to describe, makes you leap out of bed in the middle of the night, determined to save it from forever being lost in the boundless void of the human mind.",{"title":7,"searchDepth":16,"depth":16,"links":40},[],"markdown","content:blog:beyond-pastels-and-tremolos.md","content","blog/beyond-pastels-and-tremolos.md","md",{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":7,"title":8,"description":9,"subtitle":10,"author":11,"slug":12,"image":13,"alt":14,"attribution":11,"publishedDate":15,"updatedAt":15,"length":16,"wordCount":17,"body":47,"_type":41,"_id":42,"_source":43,"_file":44,"_extension":45},{"type":19,"children":48,"toc":61},[49,53,57],{"type":22,"tag":23,"props":50,"children":51},{},[52],{"type":27,"value":28},{"type":22,"tag":23,"props":54,"children":55},{},[56],{"type":27,"value":33},{"type":22,"tag":23,"props":58,"children":59},{},[60],{"type":27,"value":38},{"title":7,"searchDepth":16,"depth":16,"links":62},[],1715412343568]