{"generatedAt":1697129431534,"generateTime":174,"contents":[{"_path":"/blog/beyond-pastels-and-tremolos","_dir":"blog","_draft":false,"_partial":false,"_locale":"","_empty":false,"title":"Beyond Pastels and Tremolos","description":"While only 29 years of age, at times, it feels like I’ve surmounted three lifetimes’ worth of creative exploration already.","subtitle":"My newfound love for the written word","author":"Kilian Kukelka","slug":"/beyond-pastels-and-tremolos","image":"beyond-pastels-and-tremolos","alt":"Minimal writing setup","attribution":"Kilian Kukelka","date":"2023-10-12","updatedAt":"2023-10-12","length":2,"wordCount":476,"body":{"type":"root","children":[{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"While only 29 years of age, at times, it feels like I’ve surmounted three lifetimes’ worth of creative exploration already. This all thanks to my most curious and indecisive nature, making life appear as if it were an all-inclusive buffet, presenting me with a myriad of delicacies I have yet to indulge in. From the humble beginnings of me wanting to become a composer for TV and film, to my unavailing odyssey through the mysterious realms of painting, it is now that I find myself sitting here at my desk, with nothing but a pen and a blank piece of paper lying in front of me. I assume it’s this very simplicity, the ease with which one is able to engage with the craft, that ultimately drew me to field of writing."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Gone were the days of patiently tuning the strings on my guitar, meticulously cleaning paint brushes with brain-fog-inducing solvents, soundproofing the interior of my bedroom to get rid of its echo-y sound, spendings days of research on what type of microphone to buy or which brand of oil colors to pour my money into. Unlike its rather demanding siblings, the medium of writing is surprisingly easy to please. As long as you have a pulse and bring along some basic knowledge of the English grammar, you are free to express whatever you deem worthwhile. Whether I am doing my laundry or waiting in line at the grocery store, its omnipresence accompanies my every waking moment. Being able to revise and refine my stories within the comfort of my own head poses an unparalleled level of creative freedom that defies the rules and constraints of the physical world."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"With this newfound love for the written word, also emerged an appreciation for the plethora of concepts and ideas that spring from our imagination. My inner dialogues have become more than mere fleeting thoughts. Something precious — something to cherish — something that I must hold on to at all costs. I now find myself in obeisance to a higher power, urging me to transcribe, document, and collect any crumb of inspiration life chooses to throw my way. So much so, that I do not dare to leave my apartment without carrying some sort of notebook with me. Scattered across my room, pages upon pages filled with unfinished short stories and uncharted narratives. Hundreds of hastily-typed notes collecting virtual dust on my phone. While every now and then, this compulsion of mine can feel somewhat burdensome and exhausting, given a society of excess and overabundance, what more could one ask for than a sense of necessity? When a particular constellation of words or a most poignant way to describe, makes you leap out of bed in the middle of the night, determined to save it from forever being lost in the boundless void of the human mind."}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[]}},"_type":"markdown","_id":"content:blog:beyond-pastels-and-tremolos.md","_source":"content","_file":"blog/beyond-pastels-and-tremolos.md","_extension":"md"},{"_path":"/blog/craving-artistic-fulfillment","_dir":"blog","_draft":false,"_partial":false,"_locale":"","_empty":false,"title":"Craving Artistic Fulfillment","description":"Having now spent 18 months in the professional world of web development, the initial glamour of novelty has started to fade away. What first felt like a breath of fresh air in regard to nourishing my creative needs has turned out the be a predictable process shaped by the rules of a predefined design system.","subtitle":"Coping with the emptiness of functional design","author":"Kilian Kukelka","slug":"/craving-artistic-fulfillment","date":"2021-01-03","updatedAt":"2021-01-03","length":5,"wordCount":475,"body":{"type":"root","children":[{"type":"element","tag":"h3","props":{"id":"design-systems"},"children":[{"type":"text","value":"Design systems"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Having now spent 18 months in the professional world of web development, the initial glamour of novelty has started to fade away. What first felt like a breath of fresh air in regard to nourishing my creative needs has turned out the be a predictable process shaped by the rules of a predefined design system. Every decision about the project can be derived from this system. My thoughts have to conform to the aesthetic boundaries of the given guidelines. One may even call it declarative design. A definitive description of the desired outcome. An approach that is rock solid and inerrant once its user has mastered the tools of the trade."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The only time questions arise is when you want to explore spaces beyond such principles. But even then, the fundamental building blocks on which you can build upon are already set. There is no room for creative destruction, nor the incentive to overthrow a working system. And why should there be? This underlying structure is a vehicle for sustaining a stable cash flow. It acts as a visual outlet for the company's values and therefore has to portray a certain level of realiability and professionality. Every notion that has the potential to obscure this image will be rejected throughout the planning stages, while future design choices will be based on objective metrics deduced from A/B-testing and key perfomance indicators. And the only way to come to peace with this objective overlord is to surrender"}]},{"type":"element","tag":"h3","props":{"id":"the-price-of-reliability"},"children":[{"type":"text","value":"The price of reliability"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"While this logical way of translating ideas into reality has a beauty of its own, it’s practical use in the world of frontend engineering has shown to be limited when aiming for creative fullfilment. The purpose of a design formulated in such a way is purely functional in nature and therefore has a hard time standing on its own. Its aesthetic value always coexists in relation to a specific product or service, with the goal of increasing a predefined set of key performance indicators."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"When you spend the greater part of your week with the creation and optimization of purely functional designs, you sooner or later arrive at a point where you start to question the purpose of your creations. A potential turning point that aids you in prevailing your artistic identity. But sometimes it's hard to navigate in these murky waters, as the process on its own can be in fact engaging and rewarding. It is the result that leaves no room for the expression of oneself. The decision making process in this respect is based on logic rather than emotion and intuition. It feels like the more time I spend pursuing this way of approaching creativity, the harder it gets to tap into my inner self. All I want is to be blindfolded again. Trapped in the mace of my own naivite."}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[{"id":"design-systems","depth":3,"text":"Design systems"},{"id":"the-price-of-reliability","depth":3,"text":"The price of reliability"}]}},"_type":"markdown","_id":"content:blog:craving-artistic-fulfillment.md","_source":"content","_file":"blog/craving-artistic-fulfillment.md","_extension":"md"},{"_path":"/blog/dantes-journey-through-modern-gastronomy","_dir":"blog","_draft":false,"_partial":false,"_locale":"","_empty":false,"title":"Dante's Journey Through Modern Gastronomy","description":"After binge-eating my way out of the state of starvation I was afflicted with coming home from my latest fine-dining adventure, I felt an urgency to reflect upon this both obscure yet fascinating experience of mine.","subtitle":"Recapitulating my latest encounter with the obscure world of fine dining.","author":"Kilian Kukelka","slug":"/dantes-journey-through-modern-gastronomy","image":"dantes-journey-through-modern-gastronomy","alt":"Joseph Anton Koch, inferno, 1825-28, 05 cerbero","attribution":"Sailko, <a href=\"https://creativecommons.org/licenses/by/3.0\" target=\"_blank\" class=\"hover:underline\">CC BY 3.0</a>, via Wikimedia Commons","date":"2023-02-18","updatedAt":"2023-02-18","length":5,"wordCount":1273,"body":{"type":"root","children":[{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"After binge-eating my way out of the state of starvation I was afflicted with coming home from my latest fine-dining adventure, I felt an urgency to reflect upon this both obscure yet fascinating experience of mine. An experience only made possible thanks to the hedonistic treasure trove that is our beloved late-stage capitalism. It’s like us Westerners can’t help ourselves but to take consumerism to a degree at which it starts to become a parody of itself. We’ve managed to morph something as mundane as the act of food consumption into a classist system of oppression. In our modern-day food culture mere eating is to be considered an activity for peasants. Only those of us who’ve acquired the necessary financial means are worthy of participating in the world of dining. But I believe I’m getting ahead of myself here. Loosing myself in hyperbolic statements before the story has even begun."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"It all started with an innocent text message by a dear friend of mine, asking me if I would like to join her and her friends for dinner the day before her long-planned birthday celebration. It was very unlike me to just blindly accept this last-minute invitation without doing my fair share of meticulous research into what was going to await me, but my friend’s proven track record of memorable restaurant choices gave me enough of a push to move me out of my comfort zone. That, and the district it was located in, known for its flourishing food culture and hidden gastronomic gems."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Upon entering the establishment I was welcomed by an upbeat staff who, after giving him the name the reservation was under, guided me to a secluded, more private part of the restaurant which we accessed by taking a small detour through the winter garden. Mesmerised by the imposing decor of the interior I took a seat at the head of the table. Put on display on the wall next to me, a rich palette of liquors and numerous bottles of their house wine. Humongous jars filled with pickled chickpeas and red beets were placed all throughout the room."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"As I was the first one to arrive, aware of my indecisive nature, I used the time to take an initial glance the menu. It took me a moment to open it as my hands were still slightly numb from the snowstorm that swept through the city. Sifting through the first few pages it dawned upon me what I’ve manoeuvred myself into. This wasn’t just your average woke fusion kitchen. This was meant to be an experience. A culinary triathlon if you will. My curiosity, however, faded away in an instant when I came to realise that none of their multi course meals were suitable for devout followers of a plant based diet. It was at this moment that the rest of the party arrived. The waiter was quick to take our orders, but before we could even say a word, we were being subjected to a 5 minute monologue about the exquisite selection of drinks that they had in store for us. The brash and presumptuous undertone to his suggestions was so blatantly obvious that I couldn’t even be mad about it. And to his defence, he was nothing but a pawn in the game of chess that had been going on since the moment I had stepped foot into the place. Frustrated by the limited set of options to choose from, I simply opted for the first vegan item I could find in the menu."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The level of frustration I felt when the food finally arrived was just equally as bad. What I was presented with was a tiny portion of cauliflower florets, a few pieces of pumpernickel bread, drenched in a thick, hollandaise-like sauce. Sprinkled on top, a handful of hazelnuts and two strings of saffron. I didn’t even mind that most of the meal was served cold. After all, gas prices had been surging throughout the past year. What did bewilder me though was the taste of the food, or rather the lack thereof. Hear me out, I really gave it a shot. I genuinely was looking forward to experience the culinary sensation I was being sold on. First I mixed the hazelnuts with the cauliflower, then with the bread, then all of them together in a single bite. Sure, some of the combinations of flavours may be described as peculiar and even mildly interesting, but ultimately I was left puzzled at how a human above the age of five would be able to derive any form of pleasure from this pile of seemingly arbitrary ingredients."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Even my trip to the mens room was more of a revelation than the food I just had ingested, as I happened to eavesdrop on one of the tables I passed by. The couple had just been handed their receipt. A whopping sum of 240€. Two hundred forty euros! Have these two gentlemen been inhaling gold dust for the past 2 hours? I guess part of this financial abuse is being accounted for when being told by the minimum wage waitress how the minuscule slice of wagyu beef had been hand-massaged by a cohort of Tibetan monks before being flown half across the globe just to be devoured by a twenty-something year old junior business consultant with a self-acclaimed interest for fine dining despite ever having touched his 500$ Japanese knife set he bought himself for Christmas."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"I returned from my roundtrip shortly after. Just in time for dessert. Of course, the way in which the dishes were served also had to have some sort of „creative“ spin to it. What resulted could have been a scene out of a David Lynch movie. The appearance was almost as insulting as the food itself. The peach-coloured sorbet was to be eaten out of a tiny aluminium can, which originally was used as a storage container for sun-dried tomatoes. How do I know? Well, the hideous looking label of some no-name Slavic food producer still was attached to it. Presumably the chef’s attempt to convey a sense of frugality or pragmatism. Anywho - there I was with this ominous looking can and the sorbet inside of it. The latter looking like the partially digested form of what was initially kept in the former. To my surprise, it did in fact taste like peaches."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Once again, I found myself dumbfounded by my inability to parse the world the way other people did. Could it have been the case that it was me who was lacking the sensibility to truly appreciate the level of craftsmanship that I was presented with? But how? Not to sound brash here, but I would consider my sense of taste as rather developed. I love to eat. I love to cook. And I enjoy experimenting with the way I prepare my food. Every meal of mine is treated like a ritual and if I’m being honest, food is the only thing in life that I truly appreciate and look forward to."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"It rather appears to me that frequent guests of such establishments take the hefty price tag as a means to justify that what they just shoved down their throat must have been a moment of culinary excellence. I hate to break it to you, but if your eating habits revolve around DoorDash, the local Starbucks drive-in and your vocal distaste for „Chinese food“, I can see how such mediocre prepared meals might lead you to believe that your sensations were somewhat profound. To be fair, leaving a restaurant with a growling stomach definitely IS an experience to be remembered."}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[]}},"_type":"markdown","_id":"content:blog:dantes-journey-through-modern-gastronomy.md","_source":"content","_file":"blog/dantes-journey-through-modern-gastronomy.md","_extension":"md"},{"_path":"/blog/direction-through-comparison","_dir":"blog","_draft":false,"_partial":false,"_locale":"","_empty":false,"title":"Direction Through Comparison","description":"A vast majority of my friends - me included - have reached this certain point in life, where direction seems to be a key factor for our development. The mid 20s are slowly presenting themself as a broken compass, leaving you aimless on your journey to your next destination. What's next to come?","subtitle":"On how to reverse engineer your role models","author":"Kilian Kukelka","slug":"/direction-through-comparison","date":"2020-08-02","updatedAt":"2020-08-02","length":5,"wordCount":914,"body":{"type":"root","children":[{"type":"element","tag":"h3","props":{"id":"the-broken-compass"},"children":[{"type":"text","value":"The broken compass"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"A vast majority of my friends - me included - have reached this certain point in life, where direction seems to be a key factor for our development. The mid 20s are slowly presenting themself as a broken compass, leaving you aimless on your journey to your next destination. We have had our first peaks into the dark abyss that society calls adulthood and got battered by the illusion of finding fulfillment in a corperate structure. What we are left with is \"some\" understanding of what we may want and definitely don't want in life. But what's the next step?"}]},{"type":"element","tag":"h3","props":{"id":"observe-what-you-like"},"children":[{"type":"text","value":"Observe what you like"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"What I realized throughout the last few years of exploring my personality is that I share some very prominent features with a lot of people I admire. I really love to obsess over my role models. I consume every bit of information about them that is out there. Listening to hours of interviews. Watching documentaries. Reading forum posts about them. To my surprise, the individuals I can really, really relate to all fall into the same fields of expertise (either illustration or anything cs related for the most part). Initially I would have guessed that it would be an even distribution between all my interests."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Especially people in the music industry have let me down. In most cases, they don't seem to put as much thought into their craft as I would have expected. Or rather, as I would have wanted them to. I cannot stand listening to them explain the process behing their latest album. But their music. Oh my. Their music sends shivers down my spine. What is missing here. Is it the lack of analytical thinking on their part that is letting me down? Who knows. I guess when you strife for perfection in everything you do, you cannot rely on intuition alone. And this is one essential aspect of making music that blocks the inner workings of my brain. Well, there are ways to make music analytically. But its just not what I intend to do. It's funny that I'm aware of what keeps me from finishing any of my songs, but I'm unable to act on it. Let's get back to my initial argument."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"So on the other hand, we have illustrators and concept artists. I can listen to them talk for hours at a time. Steven Zapata, Modern Day James, Jason Brubaker, I can go on and on. You know that moment, when every line that comes out of someone's mouth makes sense. Every syllable tingles your synapses. I replay the same sentence over and over again. It's music to my ears.\nThere is so much pain and suffering that goes into their work. So much time they spend on their craft. Some even going for 16 hour work days (at least thats what some of them claim). And I really admire these guys. I actively try to be like them. Not copying traits of their personality, but their perspective on life. Which seems to be all about enjoying the process. Not thinking long-term, nor short-term. Just enjoying the moment. Call me a spiritual nutjob, but I can see value in that. I can see certain overlaps with the philosophical school of stoicism here, which teaches you not to act upon the fear of pain or the desire for pleasure. You should rather accept your current situation as is, which is exactly what many artists seem to strive after."}]},{"type":"element","tag":"h3","props":{"id":"extract"},"children":[{"type":"text","value":"Extract"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"What can we now accomplish with this insight. Lets try to cast all these trains of thought into some kind of mold - call it a hypothesis if you will. My driving assumption behind this process is that people who pursuit a specific profession probably went through similar challenges in life. They have experienced a specific kind of upbringing and presumably share a certain outlook on life. They already went through the same thought loops and came to important conclusions that my disoriented self soughs after. To stretch this assumption even further, my guess is that events in their early childhood and teenage years led such groups to have overlapping character traits and behavioural patterns. They went on to accumulate specific knowledge and interests that turned out to be especially useful in the profession they ended up in. Of course its hard to retroactively say if one's skills were aquired due to the desire to succeed in a certain profession, or if same profession just organically played into one's strenghts. Lets assume it was a combination of both."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Now extract what these individuals have learned on their journeys, which should share similar keypoints with the path you are currently on. Don't spend too much time overthinking every single action you could undertake to get out of your misery. Instead, try to incorporate some of these insights into your own philosophy. Approaches that have already shown its magic in the lifes of your role models. Change up your workflow and way of living and see what sticks. Thoughts can never unveil the actual sensation of actions. And actions are what teaches you about your shortcomings, eventually bringing you closer to your true mission in life."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Well... This piece was all over the place. I hope I can produce more structured and coherent texts in the future. Until then you have to cope with my ramblings. But even if just one sentence managed to set your brain in motion, I think it was worth the journey."}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[{"id":"the-broken-compass","depth":3,"text":"The broken compass"},{"id":"observe-what-you-like","depth":3,"text":"Observe what you like"},{"id":"extract","depth":3,"text":"Extract"}]}},"_type":"markdown","_id":"content:blog:direction-through-comparison.md","_source":"content","_file":"blog/direction-through-comparison.md","_extension":"md"},{"_path":"/blog/filling-the-void","_dir":"blog","_draft":false,"_partial":false,"_locale":"","_empty":false,"title":"Filling The Void","description":"Not one day goes by that I don't question the path that I'm currently pursuing. Something feels off. It just doesn't seem right. Not necessarilly the work that im actually doing, but the emptiness that it leaves behind. Even though I'm providing value for the team and project I'm a part of, I am not able to appreciate my doings on a personal level.","subtitle":"On what's fueling us in a world of overabundance","author":"Kilian Kukelka","slug":"/filling-the-void","date":"2020-08-16","updatedAt":"2020-08-16","length":2,"wordCount":577,"body":{"type":"root","children":[{"type":"element","tag":"h3","props":{"id":"too-much-of-everything"},"children":[{"type":"text","value":"Too much of everything"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Not one day goes by that I don't question the path that I'm currently pursuing. And while the winds are gentle and the waters are calm, it just doesn't feel right. It's not necessarily the actual work that I'm doing, but the emptiness that it leaves behind. Even though I'm providing value for the team and the project I'm a part of, I am not able to appreciate my doings on a personal level. This problem, however, comes along with a much bigger issue our society faces. Overabundance. Not only an overabundance of food and shelter necessary for our survival, but an overabundance of things we consume for pleasure. Do we really need anothere streaming service, another photo sharing app, another Frappuccino variation at your coffee chain of choice (shameless plug for the Peanut Butter Cup Frappuccino tho)?"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"That's not to say that such products require less work to produce, nor that they are less valuable just because there are similar products on the market already. It's the aftertaste they leave behind. Whether we talk about the process of consumption or production of such products, they somehow lack a sense of novelty. And this novelty is lost right when we chose to stick with the trends. That's the moment we lose the ability to take chances."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"This bias towards security arises when being confronted with the modern free market, in which a company's future is solely shaped by its financial performance. In order to peek through the endless amounts of content that we are drowning in, it has now become a necessity to copy. This trend is not only a burden for the unconscious mind of the end consumer, but also a concrete block on the feet of the creators who just want to elevate their skill set to the next level. Big players now encourage familiarity over originality due to the high financial risks associated with the production of triple A content. And this distinct level of familiarity is just enough of a dopamine hit to keep you on the hook. Just enough to keep you satisfied for the moment. But the sensation of experiencing something truly out of the blue is fading, just as our individuality surrendering to the tasteless amalgamation of repetitive content that will eventually lead to the incremental collapse of the traits that make us unique."}]},{"type":"element","tag":"h3","props":{"id":"escaping-to-creative-outlets"},"children":[{"type":"text","value":"Escaping to creative outlets"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"One of the positive side effects of such realisations is the freedom it gives to one's pursuits in life. In a world where survival is taken out of the equation, every path you take seems equally valuable (or rather expendable) for society. I believe we have arrived at a point, where creative tasks can be more valuable to yourself and your surroundings than a high tier position in a corporate setting. Both scenarios allow you to have some level of autonomy over the choices you make, but in my eyes the process of executing such decisions affects your deepest self in a totally different way. While the result of your business decisions can be measured through various performance metrics, the outcomes of pure creative pursuits are beyond such measurements - leaving the like economy of social media out of the picture for now. It resembles the true voice of a human being. An image of one's essence. An outlet to fill the emptiness of consumerism. Because there will never be an overabundance of expression."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Until next time! XOXO Kilian"}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[{"id":"too-much-of-everything","depth":3,"text":"Too much of everything"},{"id":"escaping-to-creative-outlets","depth":3,"text":"Escaping to creative outlets"}]}},"_type":"markdown","_id":"content:blog:filling-the-void.md","_source":"content","_file":"blog/filling-the-void.md","_extension":"md"},{"_path":"/blog/not-playing-by-the-rules","_dir":"blog","_draft":false,"_partial":false,"_locale":"","_empty":false,"title":"Not Playing By The Rules","description":"The lessons you learn from examining your childhood are the most insightful pieces of knowledge to explain the mannerisms of your current self.","subtitle":"When the established way just never feels right","author":"Kilian Kukelka","slug":"/not-playing-by-the-rules","date":"2021-10-22","updatedAt":"2021-10-22","length":4,"wordCount":693,"body":{"type":"root","children":[{"type":"element","tag":"h3","props":{"id":"growing-up"},"children":[{"type":"text","value":"Growing up"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Lately I've been talking a lot with my mother about me growing up and my childhood in general. What I've picked up on throughout these conversations is a certain characteristic of mine that is still following me to this day. It is my inability to play by the rules. Wether it was about learning how to tie one's shoes or how to fold a shirt, I was never able to see a reason to follow the established way of doing things. Not as a rebellion against my parents. I just did things the way they felt natural to me. Even though it was shown to me how to supposedly do tasks the \"right\" way, I never stuck to it."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"This became very apparent once I started attending elementary school. I hated being told what to learn. I hated having to be present in a specific room in a certain time of the day for this period of time. I hated being there in general. I remember being sick every other week. Endless days of playing LEGOs at home, without anyone interrupting my way of doing things - without anyone entering my world. School was torture for me. It wasn't about the other kids or having bad grades. It was about the structure that was set in place. I felt powerless. And I was stressed out permanently because I knew I had to be part of this system for a big chunk of my life."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"And this aspect of my being was present in every activity I pursued. I never built LEGO sets according to the manual. I just took the parts that were available to me and crafted my own adventure. I hated drawing things that already existed and playing songs out of a songbook. The russian school of playing the piano that was propagated by my teacher was driving me nuts. I quit after a few months and developed my own technique based on my favorite youtube tutorials."}]},{"type":"element","tag":"h3","props":{"id":"staying-sane-in-the-workplace"},"children":[{"type":"text","value":"Staying sane in the workplace"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Once I got out of school, I felt like I have been released from my shackles. Yes, there were still obstacles in front of me. But the cruicial difference was that they weren't mandatory. In university, I still got mentally exhausted from the way things were taught and how the academic construct worked as a whole. However, I wasn't forced to waste half of my day procrastinating in a class room. And this gave me hope for the future. Maybe adult life wasn't all that bad."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"And as it turns out, it isn't. I got a job in IT that gives me so much freedom of choice. Of course I have to deal with weekly deadlines and authority figures, but I can tackle any given task in the way I prefer. I have some saying in how things should be done and I have the chance to make suggestions to my superiors when I'm unhappy with a certain process. It's simply about coming to peace with the fact that any work environment will require a a tradeoff between self-actualization and conforming to a corporate way of doing things. If you can make that sacrifice, you will have a pleasant journey in most branches of business."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Looking back, the compulsory vest of the educational system probably has some right to exist. It sort of acts as a pair of training wheels for the average child. I assume that the vast majority of humans works best in a predefined enviroment. And outliers like me will have a hard time growing up."}]},{"type":"element","tag":"h3","props":{"id":"my-plans-for-the-future"},"children":[{"type":"text","value":"My plans for the future"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The only thing I haven't truly experienced yet is a complete detachment from the societal structure. A state in which the concept of core work hours doesn't exist. A reality in which I have total control over the structure of my day-to-day life. Every successful decision can be attributed to my judgement alone. And every failure is a product of my doing. I want to at least take a glimpse at what my body is truly capable of doing. Being the director of my own movie - the puppeteer pulling the strings of my existence."}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[{"id":"growing-up","depth":3,"text":"Growing up"},{"id":"staying-sane-in-the-workplace","depth":3,"text":"Staying sane in the workplace"},{"id":"my-plans-for-the-future","depth":3,"text":"My plans for the future"}]}},"_type":"markdown","_id":"content:blog:not-playing-by-the-rules.md","_source":"content","_file":"blog/not-playing-by-the-rules.md","_extension":"md"},{"_path":"/blog/on-my-relationship-with-painting","_dir":"blog","_draft":false,"_partial":false,"_locale":"","_empty":false,"title":"On My Relationship With Painting","description":"The time has come to dissect an issue that has been plaguing my mind for far too long. A question that is very close to my heart. Perhaps too close to even make a rational assessment about what is truly going on behind my ego-tinted glasses. But I'm certain that if I don’t take action now, every day that goes by will just be another attempt to catch my own tail.","subtitle":"An attempt to reflect on my distorted relationship with the craft I so deeply admire.","author":"Kilian Kukelka","slug":"/on-my-relationship-with-painting","image":"on-my-relationship-with-painting","date":"2022-10-02","updatedAt":"2022-10-02","length":8,"wordCount":833,"body":{"type":"root","children":[{"type":"element","tag":"h3","props":{"id":"the-absence-of-fun"},"children":[{"type":"text","value":"The Absence of Fun"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The time has come to dissect an issue that has been plaguing my mind for far too long. A question that is very close to my heart. Perhaps too close to even make a rational assessment about what is truly going on behind my ego-tinted glasses. But I'm certain that if I don’t take action now, every day that goes by will just be another attempt to catch my own tail. Putting my thoughts and emotions down into words seems like the only valid approach to finally come to peace with my inner demon. The issue at hand, and the very topic I seek to deconstruct throughout writing this essay, is my relationship with painting. Somewhere along the way of acquiring this new skill of mine, I've somehow managed to turn this most sacred form of expression into an act of desperation. A misconfiguration of sorts, disabling me from experiencing the true nature of the craft."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The root cause for this crisis of mine is that no matter from which angle I choose to approach the subject, I simply cannot seem to find enjoyment in the activity. Sure, on the occasion there comes a moment that could be described as a feeling of proudness or a sense of accomplishment, yet they are spread so sparsely that I have a hard time coping with the dry spells that come in between. Hence, the artistic journey has become somewhat of an uphill battle to me, with the only thing keeping me going being the satisfaction I receive upon finishing a piece. Throughout the process itself, however, I either find myself in a state of complete apathy or at the beginning of a nervous breakdown. At first I thought this to be just the initial barrier one typically faces when picking up something new. Though after now two years of trial and error, I've come to the sobering realisation that my disconnectedness to the craft cannot be simply ascribed to a lack of proficiency or discipline, but emerges from the depths of my inner workings and the way I naturally tend to interface with the world."}]},{"type":"element","tag":"h3","props":{"id":"creative-deconstruction"},"children":[{"type":"text","value":"Creative Deconstruction"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"What exactly is it that pushes me to pick up my pen if I know for certain that all I'm going to be faced with is a barricade of boredom and exhaustion? Why is it that I need to force myself to paint, even though I romanticise the idea of being an artist? Writing it out like this is making me question the reason of why I embarked on this journey in the first place. Perhaps the aspiration of becoming this idealised version of myself simply isn't enough of an incitement to keep myself motivated on a long-term basis. It's the emphasis on \"becoming\" that seems to distract me from living in the present moment. A disoriented state of mind that is purely centered around the completion of egocentric objectives, leaving no room to fathom the beauty of the creative process."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"If I'm being honest, not a single painting of mine has been started out of necessity to express myself, nor has it served me as an outlet to work through my emotions. That isn’t to say one cannot create in absence of aforementioned reasons. It’s just that for me personally, not having an inherent urge to devote myself to the matter on a day-to-day basis let’s painting become a chore rather than something I look forward to do. What has emerged is a state of disorientation. A toxic cycle that, through its deceptive prospects of fame and success, manages to keep me stuck in place. I genuinely believe, however, that the given situation is not a product of a lack of discipline and that vigorously trying to rewire myself just for the off-chance of finding enjoyment is not to be considered an appropriate response to the dilemma I’m facing. That is because in virtually every other aspect of my life, these character traits of mine give me an edge I don’t want to miss. More often than not, I truly appreciate and welcome the way my brain tends to parse and process my surroundings. My mind is, and always has been, a captive to short-term gratification. Even if that means that my pursuits are primarily guided by shortsighted motives, it is a trait that I don’t want to sacrifice."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Hence, I find myself at a crossroads of either trying to reframe my approach to painting as a whole or to discover a more fitting creative outlet all together. No matter the direction I’m going next, my number one priority is to ensure that I won’t fall into my old patterns of behaviour. To not compromise on my new set goal of finding an activity I enjoy doing regardless of its potential yield or social standing. A process that keeps me stimulated and entertained over long stretches of time, without finding myself in a state of defeat after just a few minutes of engagement."}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[{"id":"the-absence-of-fun","depth":3,"text":"The Absence of Fun"},{"id":"creative-deconstruction","depth":3,"text":"Creative Deconstruction"}]}},"_type":"markdown","_id":"content:blog:on-my-relationship-with-painting.md","_source":"content","_file":"blog/on-my-relationship-with-painting.md","_extension":"md"},{"_path":"/blog/resisting-the-dark-arts-of-big-sugar","_dir":"blog","_draft":false,"_partial":false,"_locale":"","_empty":false,"title":"Resisting The Dark Arts of Big Sugar","description":"Dear creator of the universe, what vicious notion has driven you to bestow us with this plant that is the cocoa tree. Looking at past inventions of yours, you must have been very well aware of the consequences your actions might entail.","subtitle":"On my lifelong struggle with the bittersweet muse","author":"Kilian Kukelka","slug":"/resisting-the-dark-arts-of-big-sugar","image":"resisting-the-dark-arts-of-big-sugar","alt":"Shelf full of chocolate bars","attribution":"Kilian Kukelka","date":"2023-05-06","updatedAt":"2023-05-06","length":9,"wordCount":1747,"body":{"type":"root","children":[{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Dear creator of the universe, what vicious notion has driven you to bestow us with this plant that is the cocoa tree. Looking at past inventions of yours, you must have been very well aware of the consequences your actions might entail. Once again, my species’ innate tendency to favour short-term pleasure has set us up to be particularly vulnerable to the addictive properties that lie dormant in its beans. It comes as no surprise that you have chosen for it to be concealed deep within the rainforest’s verdant embrace. Yet even your all-knowing wisdom was unable to foresee mankind's insatiable appetite for more, setting in motion the relentless pursuit to exploit the gift that was given to us."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Fast forward to the here and now, the once innocent fruits of your creation have been taken hostage by the profit-hungry entities that make up the sugar industrial complex. Like with so many other consumable goods that let us temporarily alter our perceived state of being, the opportunistic minds of the corporate world couldn’t help themselves but to start profiting off of our unfortunate evolutionary trait. And it‘s the ease with which they are able to enslave us, that makes it so frustrating to watch our growing inability to cope with the malicious practices found in modern consumer markets. A development that often causes not only our relationship, but our every interaction with food to be a gauntlet of emotions instead of the rewarding experience nature intended it to be."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The constant access thereof, a condition our ancestors would have welcomed with open hands, now puts us in the awkward position of having to actively restrain our primal instincts from making us ingest piles of sweet tasting, high-caloric landfill material. It is rather ironic how the very mechanisms that enabled humanity to flourish are now deliberately weaponized against it, all to impress some corporate suits in the next quarterly earnings call."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Makes you wonder how we got this far in the first place. When the same organ that can come up with the concept of a rocket engine will gladly throw out its last bit of dignity just to get a taste of Ritter Sport‘s newly released Crispy Banana flavor. Apparently it’s as easy as mixing the ground cocoa seeds with a bunch of milk-based derivatives and the crystallized nectar of the sugarcane for them to obtain the key to our hearts."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"By flooding the shelves with sheer endless variations of this good, products of all shapes and colors and flavors and sizes, catered to every age group and lifestyle and season of the year, the modern consumer is almost held at gunpoint whenever they are forced to pass through the vast and enticing candy aisle on their way to the checkout. Be it as a gift for a loved one or as a cure for one of those moody days, it’s allure has captivated the hearts and souls of most everyone around us. Even myself, a person I‘d consider rather disciplined and thoughtful in their actions, occasionally will give into the seductive whispers of the bittersweet muse."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"One manufacturer in particular, a small German brand by the name of Meybona, has managed to craft a blend that has captivated my taste buds from the very first bite. Despite its pretty high cocoa content of around 85%, typically resulting in a taste profile consisting mostly of bitter and earthy notes, the bar not only manages to pull off the soft creamy texture of its milk-based siblings, but also overwhelmed me with its surprisingly sweet aroma. So much so that it had me check the food label twice. I couldn’t fathom how this thing was supposed to contain only 14 grams of sugar, but there was no trickery to be found. Just 5 simple ingredients, consisting of sugar, vanilla and various cocoa solids, with no trace of artificial sweeteners in sight. A showcase of true craftsmanship."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Just this Saturday I‘ve devoured one of them in a record time of 3 minutes and 25 seconds. Perhaps I should bring to your attention that I didn’t try to set a new record (low) for myself here. It’s that my body has developed this weird talent to almost accurately synchronize the time it requires to ingest a given meal with the exact episode length of whatever tv show I happen to watch at that moment. The 3 minutes and 25 seconds was what’s left of an episode of Southpark I had started watching earlier that day. Currently catching up on the latest season. I have to say that I’m quite disappointed by the lackluster content of recent seasons. What I used to consider the pinnacle of thought-provoking satire and social commentary, nowadays often fails to live up to its former glory, effectively turning the show into nothing more than a lazy recapitulation of current events.\nAnywho, thanks to my inner demons, I couldn’t just watch the rest of the episode like a normal person would do. No, I needed to superset the given visual experience with yet another hedonistic stimulus. My rational is being hijacked by my insatiable cravings for that sweet-tasting sensation, despite me being fully aware of the ramifications such actions will have on my overall well-being. The slightly frantic state it leaves me in, the inevitable effect it will have one my sleep hygiene, the metabolic repercussions of consuming large amounts of highly refined sugar and saturated fats. All of this for a few minutes’ worth of pleasure."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"It’s fascinating to observe what lengths my body is willing to go to just so it can experience a bunch of glucose molecules rushing through its bloodstream, reminiscent of Hollywood’s depiction of a heroine addict looking for his next fix. You’d think I was exaggerating here, but during my first few years at university, I genuinely struggled to maintain a grip on my self-control. To a point at which 3 bars of chocolate a day had become the norm. Even if it was way past closing time of any nearby convenience store, I‘d always find a way to get my daily dose of sugar. Whether that meant stopping by some random gas station in the middle of nowhere (mind you I don’t own a car), or making the pilgrimage to a 24/7 supermarket at the nearest train station. None of which are locations you want to find yourself at in the middle of the night. The scenery, composed mostly of functional alcoholics, stranded tourists and pale-skinned night shift workers, was sorrowing at best. That didn’t stop me, however, from becoming a regular visitor of said establishments. On a good day, I settled with 2 bars of Milka, with at least one of them having to be the flavor featuring Lefèvre-Utile biscuits inside. The one with the prominent red-coloured wave on its packaging. If I had to choose, I‘d make it my contestant for the greatest food brand collaboration in existence. 87 grams of perfection. My favorite part was to nibble off the chocolate that surrounded each of the buscuit pieces. Saving up the salty parts for last gave me the needed palette cleanse to not get fatigued by the tidal wave of sweetness that had just swept through my mouth."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"What was initially thought of as a way of rewarding myself for surviving yet another day in the shit show that is the academic system, gradually evolved into a toxic habit that seized control of my daily life. While I perfectly well understood that my excessive consumption habits would eventually take a toll on my well-being, I was past the point at which I could still bargain with my inner voice. It took a series of rather serious health complications for me to muster enough willpower to finally break free from my compulsive behaviour. And although I emerged victorious from this battle, my sweet tooth has yet to be defeated."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"No matter which sin of the culinary world I‘m up against - be it sugary treats, salty snacks, or deep-fried delicacies - the common thread they share is the way in which they interfere with my reward mechanisms. It feels like when faced with situations that guarantee some sort of immediate relieve, the human mind is almost programmed to indulge in the temptation. When looking at the environment our ancestors had to survive in, roaming the planes of the South African wetlands, it stands to reason why we developed such tendencies in the first place. Back then, food was a necessity, rather than the hedonistic activity it has become today. One had to seize every opportunity to obtain sustenance, as scarcity and uncertainty were ever-present. But with the arrival of the Industrial Age, the invention of ever more capable machinery and ultimately the advancements in food manufacturing and preservation, humanity has effectively outpaced the speed of evolution in a matter of centuries. Imposed upon our primal instincts is now the insurmountable task of helping us steer through an environment of overabundance."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Though it should be noted, that this constant availability isn't harmful per se. It was the introduction of highly processed, calorie dense food products into our diet, that has put society into disarray. I know what you might be thinking right now, but i ask you to not let your emotions cloud your judgement. Pointing your finger at the next best industry giant won’t aid you in pulling yourself out of your misery, as the suffering that plagues you is entirely self-inflicted. At its core, the modern culinary landscape is nothing more than a reflection of the collective demand. If you ever wondered why something like Hershey‘s giant 5 pound bar exists, it is because someone is willing to pay money for it. That’s just how consumer markets tend to work. Way more interesting to decipher are the motivational factors behind such purchases, which are rooted deeply in the way in which Western society puts consumerism above all. A mental construct that has been fed to the masses since the 18th century, as a means to counteract the overproduction of goods. Ever since, our day-to-day life and social norms have been meticulously tailored to fit this given narrative, making us utilize the act of consumption as a coping mechanism to fill the void that everyday life leaves us with. Wouldn't it be wonderful if simply being conscious of this predicament was enough to break free from it? Yet here I stand, with a bar of chocolate in my shopping bag."}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[]}},"_type":"markdown","_id":"content:blog:resisting-the-dark-arts-of-big-sugar.md","_source":"content","_file":"blog/resisting-the-dark-arts-of-big-sugar.md","_extension":"md"},{"_path":"/blog/the-corporate-barrier","_dir":"blog","_draft":false,"_partial":false,"_locale":"","_empty":false,"title":"The Corporate Barrier","description":"Today's accomplishment-driven society has created a vicious rat race, leaving anyone behind that doesn't want to play by the rules. When your CV is more important than your growth as a person, one easily forgest about the joy of expressing oneself.","subtitle":"Leaving your creative freedom at the doorstep","author":"Kilian Kukelka","slug":"/the-corporate-barrier","date":"2020-09-05","updatedAt":"2020-09-05","length":3,"wordCount":423,"body":{"type":"root","children":[{"type":"element","tag":"h3","props":{"id":"growing-up"},"children":[{"type":"text","value":"Growing up"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Remember the days when your normal cause of life wasn't shaped by monetary incentives and existential dread. The days when you weren't even aware of the steep hill you have to conquer in order to progress in your creative endeavours. The ease of being a child. What growing up has took from me is the effortlessness of creating. Building your new Lego set didn't involve thinking about the long-term benefits of playing Lego. Doodling your favorite Digimon character on a rainy afternoon wasn't followed by a 30 minute self-critique session. In some cases it may had the purpose of escaping reality, but more often than not playing was just something I did. Without being attached to any exterior motive."}]},{"type":"element","tag":"h3","props":{"id":"six-internships-and-a-phd-later"},"children":[{"type":"text","value":"Six internships and a PhD later"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Today's accomplishment-driven society has created a vicious rat race, leaving anyone behind that doesn't want to play by the rules. When your CV is more important than your growth as a person, one easily forgets about the joy of expressing oneself. Everything has to result in something that can be measured in terms of progress - something that can be shared and talked about. The moment you take the secure path of working in a large or enterprise sized business, your creative pursuits have to conform with the established narrative of quarterly economic growth. There is no room for the individual voice, as it poses a risk to the revenue-driven apparatus."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Nowadays I don't feel free when I'm in the process. In the context of the corporate world - say when I have to come up with a new design solution for a website at my day job - economic and social pressure dictates my doings. And in some way, this competitive mentality has shifted the way I treat any creative pursuit in my spare time."}]},{"type":"element","tag":"h3","props":{"id":"the-hidden-enclave"},"children":[{"type":"text","value":"The hidden enclave"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Maybe they were right. Maybe my small glimpse into the corporate world already speaks for itself. There seems to be this barrier between pure creative expression and the creation of value for an organisation. Don't get me wrong. I definitely have heard of projects in which team members complement and nourish each other in a healthy way. But such places seem like very rare occurrences. To me it isn't even feasible to chase after such outliers. I believe such clusters of like-minded people happen organically, in which case there is no point in looking for our dream positions. Could it be that we just have to keep developing our skills and the right group of people will eventually find us?"}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[{"id":"growing-up","depth":3,"text":"Growing up"},{"id":"six-internships-and-a-phd-later","depth":3,"text":"Six internships and a PhD later"},{"id":"the-hidden-enclave","depth":3,"text":"The hidden enclave"}]}},"_type":"markdown","_id":"content:blog:the-corporate-barrier.md","_source":"content","_file":"blog/the-corporate-barrier.md","_extension":"md"},{"_path":"/blog/the-gamble-of-excess","_dir":"blog","_draft":false,"_partial":false,"_locale":"","_empty":false,"title":"The Gamble of Excess","description":"Who would have thought that having all 6 seasons of House of Cards at ones fingertips could turn out be the tipping point for ones sanity.","subtitle":"Being a completionist in a world of streaming services","author":"Kilian Kukelka","slug":"/the-gamble-of-excess","date":"2020-08-09","updatedAt":"2020-08-09","length":3,"wordCount":540,"body":{"type":"root","children":[{"type":"element","tag":"h3","props":{"id":"six-seasons"},"children":[{"type":"text","value":"Six seasons"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Who would have thought that having all 6 seasons of House of Cards at ones fingertips could turn out be the tipping point for ones sanity. I love the feeling of finishing things. Whether its of artificial nature like collecting x amount of y in a video game, or the the completion of this very essay. But when it gets to passive activities such as watching Netflix, something doesn't seem to work as intended in the mess called my brain."}]},{"type":"element","tag":"h3","props":{"id":"the-gamble-of-excess"},"children":[{"type":"text","value":"The gamble of excess"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The pattern starts out very innocent. I scroll through the seemingly endless stream of content. Sometimes something will peak my interest, sometimes I just add another semi-interesting thing that I'll probably never consume to my watchlist. But hey, whats that?! A notification on the bell-thingie. I better get ready for the latest iteration of "},{"type":"element","tag":"em","props":{},"children":[{"type":"text","value":"Insert Scandinavian Detective Duo"}]},{"type":"text","value":".\nRarely it turns out to be a gem. Which I welcome. The occassional \"healthy\" binge that keeps you at the edge of your seat.\nMost of the time, however, 3 episodes in the show unmasks itself as the same bland, no-brand coffee capsule you cram into your Pixie machine every morning. Just enough of a push to get you going. You just wanna escape for an hour. Who can blame you?"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Now it's 9 p.m. and I realize what monstrosity I have awoken. I ESC out of fullscreen mode to take a glance at the progress bar (I honestly don't know what it's called ... yes, thats the quality you get when hiring a Junior Frontend Dev in 2020 ). Shit, I'm only halfway through this mess. What have I done? And then the feeling of failure slowly starts kreeping into my consciousness. Telling myself that I don't have the willpower to finish this damn thing. Knowing that I already invested hours of my life into this show. I don't know what part of evolution takes over at this point, but I honestly wish I could apply it on other areas of my life. So what happens is that all this morphs into some kind of coping mechanism where my brain comes up with the ingenious strategy to finish the whole season in one sitting in order to be liberated form this burden. This of course comes with the underlying notion of quitting streaming altogether from this day one, which turns out to never be as easy as it seems. The days come where I'm work has torn me down to the point where I cannot resist. And time and time again, I'll power through it. When you keep watching that one show just for the sake of getting it over with, you know something's off."}]},{"type":"element","tag":"h3","props":{"id":"what-comes-next"},"children":[{"type":"text","value":"What comes next"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Have I found a solution by now? You wish. At least I managed to stay away from Netflix for a few days now. Next on the hit-list are Twitch and Twitter. As with every big change in one's life, there needs to be a trigger of the same proportions. And currently it seems as if my streaming habbits are'nt spriraling out of control just yet. I still manage to get things done. I still enjoy some of the short term gratification that streaming provides. I just... feel numb."}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[{"id":"six-seasons","depth":3,"text":"Six seasons"},{"id":"the-gamble-of-excess","depth":3,"text":"The gamble of excess"},{"id":"what-comes-next","depth":3,"text":"What comes next"}]}},"_type":"markdown","_id":"content:blog:the-gamble-of-excess.md","_source":"content","_file":"blog/the-gamble-of-excess.md","_extension":"md"},{"_path":"/blog/the-yield-of-honesty","_dir":"blog","_draft":false,"_partial":false,"_locale":"","_empty":false,"title":"The Yield of Honesty","description":"Honesty. A luxurious good in current times. Because without it, what's a conversation even good for? So let's grab our adventure bags and hop on the quest of being the most honest self we can be.","subtitle":"The benefits of being honest to yourself and your surroundings","author":"Kilian Kukelka","slug":"/the-yield-of-honesty","date":"2020-08-24","updatedAt":"2020-08-24","length":6,"wordCount":728,"body":{"type":"root","children":[{"type":"element","tag":"h3","props":{"id":"being-honest-to-youself"},"children":[{"type":"text","value":"Being honest to youself"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Honesty. A luxurious good in current times. Because without it, what's a conversation even good for? So let's grab our adventure bags and hop on the quest of being the most honest self we can be. As with most of my journeys, the starting point is centered around self exploration. Only after we break the barrier of lies within ourselves, we are able to truly appreciate how us being honest can affect the lives of our fellow human beings.\nEvery time we lie to ourselves, we sort of create an anabranch of our current stream of life. And if we keep lying over and over again, it gets harder and harder to rejoin with the main stem of the stream. That is what you want to avoid at all cost. To let lying become a habit. There's a reason why pathological lying is a diagnosable mental disorder. We get lost in diversion and can't even tell what course we are on anymore. A lie may present itself as an easy solution in the short term, but eventually you will find youself tangled in a web of personal distress."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"You may ask for a quick solution to help you out of this misery. But there isn't. You can improve, however - gradually - one step at a time. Yes, it will be uncormfortable at times. And once you are able to shield yourself against any potential shame and judgement you will encounter, it will become effortless. An extension of your former self. Time will pass and you will notice the potency of your harvest. It will let you move towards your goals in the most efficient way possible. No more hypotheticals and what-ifs, because after all there only is "},{"type":"element","tag":"em","props":{},"children":[{"type":"text","value":"one"}]},{"type":"text","value":" honest truth."}]},{"type":"element","tag":"h3","props":{"id":"being-honest-to-your-friends-family"},"children":[{"type":"text","value":"Being honest to your friends & family"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"When it comes to the relationships with your friends and family members, we often tend to be a bit more careful about how we phrase our sentences, what words we choose and how we want to convey a message. We try to avoid any scenario where this precious bonding is at harm, even if it would change things for the better. The power of words has never been more apparent. There is, however, a way of communicating your thoughts in a more sensitive way - call it consumer-friendly packaging if you will. You don't even have to implicitly tell them your thoughts, but rather help them come to the conclusion themselves. This can be achieved through burrowing subtle messages into your dialogues. Gently massaging them into the consciousness of your conversational partner. This way we don't have to confront people with a tsunami of truth. It's more like jumpstarting their journey of self-discovery. Whether its about relationship advice, important life decisions or tough financial situations. Most of the time, they already know the answer themselves. They just need some help adjusting the spotlight."}]},{"type":"element","tag":"h3","props":{"id":"being-honest-to-your-coworkers"},"children":[{"type":"text","value":"Being honest to your coworkers"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Last but not least, I want to speak on the benefits of being honest to your coworkers. At first you might be appalled at the idea of speaking your mind in a corporate setting. After all, its an enviroment of professionalism and formality. Your livelihood is on the line. But there is a reason why they hired you. Because they valued the skills you have aquired. And throughout this aquisition process, you've encountered a variety of problems - some of which you were able to successfully overcome and some of which turned out to be utter failures."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"But in the end, each one of those experiences comes with a lesson you have learned. An opinion you have formed, backed by the results of your actions. This is where honesty lives. And you have the obligation to tell the world about this valuable source of truth. From what I've gathered in my personal life is that being honest and upfront with your team members and superiors can elevate the spirit and efficiency of your workplace to the next level. As with everything else balance is important - everybody's ego deserves to have its moment. There are moments when you have to respectfully accept decisions that seem to be out of your control. You even might feel a sence of deception in the air. But I command you to uphold an honest relationship with your surroundings, as clarity will scatter the vicious fog of lies."}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[{"id":"being-honest-to-youself","depth":3,"text":"Being honest to youself"},{"id":"being-honest-to-your-friends-family","depth":3,"text":"Being honest to your friends & family"},{"id":"being-honest-to-your-coworkers","depth":3,"text":"Being honest to your coworkers"}]}},"_type":"markdown","_id":"content:blog:the-yield-of-honesty.md","_source":"content","_file":"blog/the-yield-of-honesty.md","_extension":"md"},{"_path":"/blog/welcome-the-end","_dir":"blog","_draft":false,"_partial":false,"_locale":"","_empty":false,"title":"Welcome the End","description":"In times of social uproar, economic downturns and seemingly daily environmental disasters, it is getting increasingly harder for me to keep a healthy mindset.","subtitle":"The value of friendship in a burning world","author":"Kilian Kukelka","slug":"/welcome-the-end","date":"2020-09-13","updatedAt":"2020-09-13","length":3,"wordCount":564,"body":{"type":"root","children":[{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"In times of social uproar, economic downturns and seemingly daily environmental disasters, it is getting increasingly harder for me to keep a healthy mindset. All the hours I spent soul searching in the last few years seem to have gone to waste. Just when you think you have finally figured it out, your efforts suddenly lose all their meaning. What's the point of trying anymore? What's the point of developing your skills? When in the next few years, the way we treated nature in the past is gonna catch up with us."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"We have grown accustomed to our wasteful way of living, and no disruption is gonna change that behaviour in the near future. Once the option has been established, we have crossed the point of no return. Can you imagine the pushback when there are suddenly no bananas available anymore? When there is no imported coffee from across the globe on the shelves? I for one would be more than happy with such changes. But the vast majority of people doesn't seem to recognise the enormous carbon output it takes to transfer the ecuadorian chocolate nibs into their breakfast bowl (which itself was probably manufactured in a third world country of your choice)."}]},{"type":"element","tag":"h3","props":{"id":"the-sad-realisation"},"children":[{"type":"text","value":"The sad realisation"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"What is truly sad is that we actually have figured it out. There is a way of doing this sustainably. During this pandemic, there were moments when I thought we would have finally learned our lesson. But I was wrong. Everything is back to normal. We have lost some people on the way. But there's no sign of stopping the machinery of capitalism. There is a voice inside of me that actually wants to see society crumble - to witness the downfall evoked by our wrongdoings. If there's not gonna be a revelation of any superior motive to all of this, I sincerely believe we have set our course towards the abyss."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"What's even more disappointing is the fact that I feel powerless in regards to the current situation. When there are entire corporations rooting for the wrong team, what power do I have as an individual? You are shouting against a brick wall. One may look at social media as a viable solution to amplify your voice, but even here the playing field is not even. You will eventually drown in a pool of meaningless content and purposely spread disinformation. It isn't about the message anymore, the real economic value is attention. And that's what our vision is missing. We cannot feed the program - it therefore cannot be catered to an audience of short-term thinkers and zombies of the status quo."}]},{"type":"element","tag":"h3","props":{"id":"finding-relief-in-the-chaos"},"children":[{"type":"text","value":"Finding relief in the chaos"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"One a more positive note, 2020 has taught me a lot about what is truly valuable in life. How is a digital number stored on a bank server gonna help you with your inner demons? How is a new flatscreen TV gonna soothe your existential dread? What are we left with when shit hits the fan? Humans. While I was trapped in the rat race, it was my fellow human beings that I left out of the picture. The joy of sharing, talking or just simply sitting right next to your best friend. That's when you realise that we are all passengers on the same train. Yes, our destination may be unknown. But we have each other to make it there."}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[{"id":"the-sad-realisation","depth":3,"text":"The sad realisation"},{"id":"finding-relief-in-the-chaos","depth":3,"text":"Finding relief in the chaos"}]}},"_type":"markdown","_id":"content:blog:welcome-the-end.md","_source":"content","_file":"blog/welcome-the-end.md","_extension":"md"},{"_path":"/publications/the-joy-of-observation","_dir":"publications","_draft":false,"_partial":false,"_locale":"","_empty":true,"title":"The Joy of Observation","description":"Come and join Juliet on her daily odyssey through the never-sleeping streets of the concrete jungle. Feeding the birds at Wendriff park, indulging in delicious pastries at her favorite French Bistro, or leisurely sipping a latte at McCliffton's on 8th Street. Just make sure to not lose yourself in the superficiality of it all, as you will miss out on the beauty that is hidden in the mundanity of everyday life.","author":"Kilian Kukelka","image":"the-joy-of-observation","alt":"Book Cover","attribution":"© Kilian Kukelka","publicationDate":"2023-09-01","updatedAt":"2023-09-22","distributors":[{"key":"thalia","alt":"Thalia","format":"Hardcover","link":"https://www.thalia.at/shop/home/artikeldetails/A1069601323"}],"body":{"type":"root","children":[],"toc":{"title":"","searchDepth":2,"depth":2,"links":[]}},"_type":"markdown","_id":"content:publications:the-joy-of-observation.md","_source":"content","_file":"publications/the-joy-of-observation.md","_extension":"md"}],"navigation":[{"title":"Blog","_path":"/blog","children":[{"title":"Beyond Pastels and Tremolos","_path":"/blog/beyond-pastels-and-tremolos"},{"title":"Craving Artistic Fulfillment","_path":"/blog/craving-artistic-fulfillment"},{"title":"Dante's Journey Through Modern Gastronomy","_path":"/blog/dantes-journey-through-modern-gastronomy"},{"title":"Direction Through Comparison","_path":"/blog/direction-through-comparison"},{"title":"Filling The Void","_path":"/blog/filling-the-void"},{"title":"Not Playing By The Rules","_path":"/blog/not-playing-by-the-rules"},{"title":"On My Relationship With Painting","_path":"/blog/on-my-relationship-with-painting"},{"title":"Resisting The Dark Arts of Big Sugar","_path":"/blog/resisting-the-dark-arts-of-big-sugar"},{"title":"The Corporate Barrier","_path":"/blog/the-corporate-barrier"},{"title":"The Gamble of Excess","_path":"/blog/the-gamble-of-excess"},{"title":"The Yield of Honesty","_path":"/blog/the-yield-of-honesty"},{"title":"Welcome the End","_path":"/blog/welcome-the-end"}]},{"title":"Publications","_path":"/publications","children":[{"title":"The Joy of Observation","_path":"/publications/the-joy-of-observation"}]}]}