[{"data":1,"prerenderedAt":136},["Reactive",2],{"/blog/not-playing-by-the-rules":3,"content-query-z4ZLtpeexH":88},{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":7,"_empty":6,"title":8,"description":9,"subtitle":10,"author":11,"slug":12,"date":13,"updatedAt":13,"length":14,"wordCount":15,"body":16,"_type":83,"_id":84,"_source":85,"_file":86,"_extension":87},"/blog/not-playing-by-the-rules","blog",false,"","Not Playing By The Rules","The lessons you learn from examining your childhood are the most insightful pieces of knowledge to explain the mannerisms of your current self.","When the established way just never feels right","Kilian Kukelka","/not-playing-by-the-rules","2021-10-22",4,693,{"type":17,"children":18,"toc":76},"root",[19,28,34,39,44,50,55,60,65,71],{"type":20,"tag":21,"props":22,"children":24},"element","h3",{"id":23},"growing-up",[25],{"type":26,"value":27},"text","Growing up",{"type":20,"tag":29,"props":30,"children":31},"p",{},[32],{"type":26,"value":33},"Lately I've been talking a lot with my mother about me growing up and my childhood in general. What I've picked up on throughout these conversations is a certain characteristic of mine that is still following me to this day. It is my inability to play by the rules. Wether it was about learning how to tie one's shoes or how to fold a shirt, I was never able to see a reason to follow the established way of doing things. Not as a rebellion against my parents. I just did things the way they felt natural to me. Even though it was shown to me how to supposedly do tasks the \"right\" way, I never stuck to it.",{"type":20,"tag":29,"props":35,"children":36},{},[37],{"type":26,"value":38},"This became very apparent once I started attending elementary school. I hated being told what to learn. I hated having to be present in a specific room in a certain time of the day for this period of time. I hated being there in general. I remember being sick every other week. Endless days of playing LEGOs at home, without anyone interrupting my way of doing things - without anyone entering my world. School was torture for me. It wasn't about the other kids or having bad grades. It was about the structure that was set in place. I felt powerless. And I was stressed out permanently because I knew I had to be part of this system for a big chunk of my life.",{"type":20,"tag":29,"props":40,"children":41},{},[42],{"type":26,"value":43},"And this aspect of my being was present in every activity I pursued. I never built LEGO sets according to the manual. I just took the parts that were available to me and crafted my own adventure. I hated drawing things that already existed and playing songs out of a songbook. The russian school of playing the piano that was propagated by my teacher was driving me nuts. I quit after a few months and developed my own technique based on my favorite youtube tutorials.",{"type":20,"tag":21,"props":45,"children":47},{"id":46},"staying-sane-in-the-workplace",[48],{"type":26,"value":49},"Staying sane in the workplace",{"type":20,"tag":29,"props":51,"children":52},{},[53],{"type":26,"value":54},"Once I got out of school, I felt like I have been released from my shackles. Yes, there were still obstacles in front of me. But the cruicial difference was that they weren't mandatory. In university, I still got mentally exhausted from the way things were taught and how the academic construct worked as a whole. However, I wasn't forced to waste half of my day procrastinating in a class room. And this gave me hope for the future. Maybe adult life wasn't all that bad.",{"type":20,"tag":29,"props":56,"children":57},{},[58],{"type":26,"value":59},"And as it turns out, it isn't. I got a job in IT that gives me so much freedom of choice. Of course I have to deal with weekly deadlines and authority figures, but I can tackle any given task in the way I prefer. I have some saying in how things should be done and I have the chance to make suggestions to my superiors when I'm unhappy with a certain process. It's simply about coming to peace with the fact that any work environment will require a a tradeoff between self-actualization and conforming to a corporate way of doing things. If you can make that sacrifice, you will have a pleasant journey in most branches of business.",{"type":20,"tag":29,"props":61,"children":62},{},[63],{"type":26,"value":64},"Looking back, the compulsory vest of the educational system probably has some right to exist. It sort of acts as a pair of training wheels for the average child. I assume that the vast majority of humans works best in a predefined enviroment. And outliers like me will have a hard time growing up.",{"type":20,"tag":21,"props":66,"children":68},{"id":67},"my-plans-for-the-future",[69],{"type":26,"value":70},"My plans for the future",{"type":20,"tag":29,"props":72,"children":73},{},[74],{"type":26,"value":75},"The only thing I haven't truly experienced yet is a complete detachment from the societal structure. A state in which the concept of core work hours doesn't exist. A reality in which I have total control over the structure of my day-to-day life. Every successful decision can be attributed to my judgement alone. And every failure is a product of my doing. I want to at least take a glimpse at what my body is truly capable of doing. Being the director of my own movie - the puppeteer pulling the strings of my existence.",{"title":7,"searchDepth":77,"depth":77,"links":78},2,[79,81,82],{"id":23,"depth":80,"text":27},3,{"id":46,"depth":80,"text":49},{"id":67,"depth":80,"text":70},"markdown","content:blog:not-playing-by-the-rules.md","content","blog/not-playing-by-the-rules.md","md",{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":7,"_empty":6,"title":8,"description":9,"subtitle":10,"author":11,"slug":12,"date":13,"updatedAt":13,"length":14,"wordCount":15,"body":89,"_type":83,"_id":84,"_source":85,"_file":86,"_extension":87},{"type":17,"children":90,"toc":131},[91,95,99,103,107,111,115,119,123,127],{"type":20,"tag":21,"props":92,"children":93},{"id":23},[94],{"type":26,"value":27},{"type":20,"tag":29,"props":96,"children":97},{},[98],{"type":26,"value":33},{"type":20,"tag":29,"props":100,"children":101},{},[102],{"type":26,"value":38},{"type":20,"tag":29,"props":104,"children":105},{},[106],{"type":26,"value":43},{"type":20,"tag":21,"props":108,"children":109},{"id":46},[110],{"type":26,"value":49},{"type":20,"tag":29,"props":112,"children":113},{},[114],{"type":26,"value":54},{"type":20,"tag":29,"props":116,"children":117},{},[118],{"type":26,"value":59},{"type":20,"tag":29,"props":120,"children":121},{},[122],{"type":26,"value":64},{"type":20,"tag":21,"props":124,"children":125},{"id":67},[126],{"type":26,"value":70},{"type":20,"tag":29,"props":128,"children":129},{},[130],{"type":26,"value":75},{"title":7,"searchDepth":77,"depth":77,"links":132},[133,134,135],{"id":23,"depth":80,"text":27},{"id":46,"depth":80,"text":49},{"id":67,"depth":80,"text":70},1697129431714]