[{"data":1,"prerenderedAt":131},["Reactive",2],{"/blog/the-yield-of-honesty":3,"content-query-w0ixhAuNKP":86},{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":7,"_empty":6,"title":8,"description":9,"subtitle":10,"author":11,"slug":12,"date":13,"updatedAt":13,"length":14,"wordCount":15,"body":16,"_type":81,"_id":82,"_source":83,"_file":84,"_extension":85},"/blog/the-yield-of-honesty","blog",false,"","The Yield of Honesty","Honesty. A luxurious good in current times. Because without it, what's a conversation even good for? So let's grab our adventure bags and hop on the quest of being the most honest self we can be.","The benefits of being honest to yourself and your surroundings","Kilian Kukelka","/the-yield-of-honesty","2020-08-24",6,728,{"type":17,"children":18,"toc":74},"root",[19,28,34,47,53,58,64,69],{"type":20,"tag":21,"props":22,"children":24},"element","h3",{"id":23},"being-honest-to-youself",[25],{"type":26,"value":27},"text","Being honest to youself",{"type":20,"tag":29,"props":30,"children":31},"p",{},[32],{"type":26,"value":33},"Honesty. A luxurious good in current times. Because without it, what's a conversation even good for? So let's grab our adventure bags and hop on the quest of being the most honest self we can be. As with most of my journeys, the starting point is centered around self exploration. Only after we break the barrier of lies within ourselves, we are able to truly appreciate how us being honest can affect the lives of our fellow human beings.\nEvery time we lie to ourselves, we sort of create an anabranch of our current stream of life. And if we keep lying over and over again, it gets harder and harder to rejoin with the main stem of the stream. That is what you want to avoid at all cost. To let lying become a habit. There's a reason why pathological lying is a diagnosable mental disorder. We get lost in diversion and can't even tell what course we are on anymore. A lie may present itself as an easy solution in the short term, but eventually you will find youself tangled in a web of personal distress.",{"type":20,"tag":29,"props":35,"children":36},{},[37,39,45],{"type":26,"value":38},"You may ask for a quick solution to help you out of this misery. But there isn't. You can improve, however - gradually - one step at a time. Yes, it will be uncormfortable at times. And once you are able to shield yourself against any potential shame and judgement you will encounter, it will become effortless. An extension of your former self. Time will pass and you will notice the potency of your harvest. It will let you move towards your goals in the most efficient way possible. No more hypotheticals and what-ifs, because after all there only is ",{"type":20,"tag":40,"props":41,"children":42},"em",{},[43],{"type":26,"value":44},"one",{"type":26,"value":46}," honest truth.",{"type":20,"tag":21,"props":48,"children":50},{"id":49},"being-honest-to-your-friends-family",[51],{"type":26,"value":52},"Being honest to your friends & family",{"type":20,"tag":29,"props":54,"children":55},{},[56],{"type":26,"value":57},"When it comes to the relationships with your friends and family members, we often tend to be a bit more careful about how we phrase our sentences, what words we choose and how we want to convey a message. We try to avoid any scenario where this precious bonding is at harm, even if it would change things for the better. The power of words has never been more apparent. There is, however, a way of communicating your thoughts in a more sensitive way - call it consumer-friendly packaging if you will. You don't even have to implicitly tell them your thoughts, but rather help them come to the conclusion themselves. This can be achieved through burrowing subtle messages into your dialogues. Gently massaging them into the consciousness of your conversational partner. This way we don't have to confront people with a tsunami of truth. It's more like jumpstarting their journey of self-discovery. Whether its about relationship advice, important life decisions or tough financial situations. Most of the time, they already know the answer themselves. They just need some help adjusting the spotlight.",{"type":20,"tag":21,"props":59,"children":61},{"id":60},"being-honest-to-your-coworkers",[62],{"type":26,"value":63},"Being honest to your coworkers",{"type":20,"tag":29,"props":65,"children":66},{},[67],{"type":26,"value":68},"Last but not least, I want to speak on the benefits of being honest to your coworkers. At first you might be appalled at the idea of speaking your mind in a corporate setting. After all, its an enviroment of professionalism and formality. Your livelihood is on the line. But there is a reason why they hired you. Because they valued the skills you have aquired. And throughout this aquisition process, you've encountered a variety of problems - some of which you were able to successfully overcome and some of which turned out to be utter failures.",{"type":20,"tag":29,"props":70,"children":71},{},[72],{"type":26,"value":73},"But in the end, each one of those experiences comes with a lesson you have learned. An opinion you have formed, backed by the results of your actions. This is where honesty lives. And you have the obligation to tell the world about this valuable source of truth. From what I've gathered in my personal life is that being honest and upfront with your team members and superiors can elevate the spirit and efficiency of your workplace to the next level. As with everything else balance is important - everybody's ego deserves to have its moment. There are moments when you have to respectfully accept decisions that seem to be out of your control. You even might feel a sence of deception in the air. But I command you to uphold an honest relationship with your surroundings, as clarity will scatter the vicious fog of lies.",{"title":7,"searchDepth":75,"depth":75,"links":76},2,[77,79,80],{"id":23,"depth":78,"text":27},3,{"id":49,"depth":78,"text":52},{"id":60,"depth":78,"text":63},"markdown","content:blog:the-yield-of-honesty.md","content","blog/the-yield-of-honesty.md","md",{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":7,"_empty":6,"title":8,"description":9,"subtitle":10,"author":11,"slug":12,"date":13,"updatedAt":13,"length":14,"wordCount":15,"body":87,"_type":81,"_id":82,"_source":83,"_file":84,"_extension":85},{"type":17,"children":88,"toc":126},[89,93,97,106,110,114,118,122],{"type":20,"tag":21,"props":90,"children":91},{"id":23},[92],{"type":26,"value":27},{"type":20,"tag":29,"props":94,"children":95},{},[96],{"type":26,"value":33},{"type":20,"tag":29,"props":98,"children":99},{},[100,101,105],{"type":26,"value":38},{"type":20,"tag":40,"props":102,"children":103},{},[104],{"type":26,"value":44},{"type":26,"value":46},{"type":20,"tag":21,"props":107,"children":108},{"id":49},[109],{"type":26,"value":52},{"type":20,"tag":29,"props":111,"children":112},{},[113],{"type":26,"value":57},{"type":20,"tag":21,"props":115,"children":116},{"id":60},[117],{"type":26,"value":63},{"type":20,"tag":29,"props":119,"children":120},{},[121],{"type":26,"value":68},{"type":20,"tag":29,"props":123,"children":124},{},[125],{"type":26,"value":73},{"title":7,"searchDepth":75,"depth":75,"links":127},[128,129,130],{"id":23,"depth":78,"text":27},{"id":49,"depth":78,"text":52},{"id":60,"depth":78,"text":63},1689918184105]