[{"data":1,"prerenderedAt":97},["Reactive",2],{"/blog/craving-artistic-fulfillment":3,"content-query-j8qWcdDCFE":66},{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":7,"_empty":6,"title":8,"description":9,"subtitle":10,"author":11,"slug":12,"date":13,"updatedAt":13,"length":14,"wordCount":15,"body":16,"_type":61,"_id":62,"_source":63,"_file":64,"_extension":65},"/blog/craving-artistic-fulfillment","blog",false,"","Craving Artistic Fulfillment","Having now spent 18 months in the professional world of web development, the initial glamour of novelty has started to fade away. What first felt like a breath of fresh air in regard to nourishing my creative needs has turned out the be a predictable process shaped by the rules of a predefined design system.","Coping with the emptiness of functional design","Kilian Kukelka","/craving-artistic-fulfillment","2021-01-03",5,475,{"type":17,"children":18,"toc":55},"root",[19,28,34,39,45,50],{"type":20,"tag":21,"props":22,"children":24},"element","h3",{"id":23},"design-systems",[25],{"type":26,"value":27},"text","Design systems",{"type":20,"tag":29,"props":30,"children":31},"p",{},[32],{"type":26,"value":33},"Having now spent 18 months in the professional world of web development, the initial glamour of novelty has started to fade away. What first felt like a breath of fresh air in regard to nourishing my creative needs has turned out the be a predictable process shaped by the rules of a predefined design system. Every decision about the project can be derived from this system. My thoughts have to conform to the aesthetic boundaries of the given guidelines. One may even call it declarative design. A definitive description of the desired outcome. An approach that is rock solid and inerrant once its user has mastered the tools of the trade.",{"type":20,"tag":29,"props":35,"children":36},{},[37],{"type":26,"value":38},"The only time questions arise is when you want to explore spaces beyond such principles. But even then, the fundamental building blocks on which you can build upon are already set. There is no room for creative destruction, nor the incentive to overthrow a working system. And why should there be? This underlying structure is a vehicle for sustaining a stable cash flow. It acts as a visual outlet for the company's values and therefore has to portray a certain level of realiability and professionality. Every notion that has the potential to obscure this image will be rejected throughout the planning stages, while future design choices will be based on objective metrics deduced from A/B-testing and key perfomance indicators. And the only way to come to peace with this objective overlord is to surrender",{"type":20,"tag":21,"props":40,"children":42},{"id":41},"the-price-of-reliability",[43],{"type":26,"value":44},"The price of reliability",{"type":20,"tag":29,"props":46,"children":47},{},[48],{"type":26,"value":49},"While this logical way of translating ideas into reality has a beauty of its own, it’s practical use in the world of frontend engineering has shown to be limited when aiming for creative fullfilment. The purpose of a design formulated in such a way is purely functional in nature and therefore has a hard time standing on its own. Its aesthetic value always coexists in relation to a specific product or service, with the goal of increasing a predefined set of key performance indicators.",{"type":20,"tag":29,"props":51,"children":52},{},[53],{"type":26,"value":54},"When you spend the greater part of your week with the creation and optimization of purely functional designs, you sooner or later arrive at a point where you start to question the purpose of your creations. A potential turning point that aids you in prevailing your artistic identity. But sometimes it's hard to navigate in these murky waters, as the process on its own can be in fact engaging and rewarding. It is the result that leaves no room for the expression of oneself. The decision making process in this respect is based on logic rather than emotion and intuition. It feels like the more time I spend pursuing this way of approaching creativity, the harder it gets to tap into my inner self. All I want is to be blindfolded again. Trapped in the mace of my own naivite.",{"title":7,"searchDepth":56,"depth":56,"links":57},2,[58,60],{"id":23,"depth":59,"text":27},3,{"id":41,"depth":59,"text":44},"markdown","content:blog:craving-artistic-fulfillment.md","content","blog/craving-artistic-fulfillment.md","md",{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":7,"_empty":6,"title":8,"description":9,"subtitle":10,"author":11,"slug":12,"date":13,"updatedAt":13,"length":14,"wordCount":15,"body":67,"_type":61,"_id":62,"_source":63,"_file":64,"_extension":65},{"type":17,"children":68,"toc":93},[69,73,77,81,85,89],{"type":20,"tag":21,"props":70,"children":71},{"id":23},[72],{"type":26,"value":27},{"type":20,"tag":29,"props":74,"children":75},{},[76],{"type":26,"value":33},{"type":20,"tag":29,"props":78,"children":79},{},[80],{"type":26,"value":38},{"type":20,"tag":21,"props":82,"children":83},{"id":41},[84],{"type":26,"value":44},{"type":20,"tag":29,"props":86,"children":87},{},[88],{"type":26,"value":49},{"type":20,"tag":29,"props":90,"children":91},{},[92],{"type":26,"value":54},{"title":7,"searchDepth":56,"depth":56,"links":94},[95,96],{"id":23,"depth":59,"text":27},{"id":41,"depth":59,"text":44},1695921836253]