[{"data":1,"prerenderedAt":109},["ShallowReactive",2],{"/blog/the-corporate-barrier":3,"content-query-dmcT6Ir00b":73},{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":7,"title":8,"description":9,"subtitle":10,"author":11,"slug":12,"publishedDate":13,"updatedAt":13,"length":14,"wordCount":15,"body":16,"_type":67,"_id":68,"_source":69,"_file":70,"_stem":71,"_extension":72},"/blog/the-corporate-barrier","blog",false,"","The Corporate Barrier","Today's accomplishment-driven society has created a vicious rat race, leaving anyone behind that doesn't want to play by the rules. When your CV is more important than your growth as a person, one easily forgest about the joy of expressing oneself.","Leaving your creative freedom at the doorstep","Kilian Kukelka","/the-corporate-barrier","2020-09-05",3,423,{"type":17,"children":18,"toc":61},"root",[19,28,34,40,45,50,56],{"type":20,"tag":21,"props":22,"children":24},"element","h3",{"id":23},"growing-up",[25],{"type":26,"value":27},"text","Growing up",{"type":20,"tag":29,"props":30,"children":31},"p",{},[32],{"type":26,"value":33},"Remember the days when your normal cause of life wasn't shaped by monetary incentives and existential dread. The days when you weren't even aware of the steep hill you have to conquer in order to progress in your creative endeavours. The ease of being a child. What growing up has took from me is the effortlessness of creating. Building your new Lego set didn't involve thinking about the long-term benefits of playing Lego. Doodling your favorite Digimon character on a rainy afternoon wasn't followed by a 30 minute self-critique session. In some cases it may had the purpose of escaping reality, but more often than not playing was just something I did. Without being attached to any exterior motive.",{"type":20,"tag":21,"props":35,"children":37},{"id":36},"six-internships-and-a-phd-later",[38],{"type":26,"value":39},"Six internships and a PhD later",{"type":20,"tag":29,"props":41,"children":42},{},[43],{"type":26,"value":44},"Today's accomplishment-driven society has created a vicious rat race, leaving anyone behind that doesn't want to play by the rules. When your CV is more important than your growth as a person, one easily forgets about the joy of expressing oneself. Everything has to result in something that can be measured in terms of progress - something that can be shared and talked about. The moment you take the secure path of working in a large or enterprise sized business, your creative pursuits have to conform with the established narrative of quarterly economic growth. There is no room for the individual voice, as it poses a risk to the revenue-driven apparatus.",{"type":20,"tag":29,"props":46,"children":47},{},[48],{"type":26,"value":49},"Nowadays I don't feel free when I'm in the process. In the context of the corporate world - say when I have to come up with a new design solution for a website at my day job - economic and social pressure dictates my doings. And in some way, this competitive mentality has shifted the way I treat any creative pursuit in my spare time.",{"type":20,"tag":21,"props":51,"children":53},{"id":52},"the-hidden-enclave",[54],{"type":26,"value":55},"The hidden enclave",{"type":20,"tag":29,"props":57,"children":58},{},[59],{"type":26,"value":60},"Maybe they were right. Maybe my small glimpse into the corporate world already speaks for itself. There seems to be this barrier between pure creative expression and the creation of value for an organisation. Don't get me wrong. I definitely have heard of projects in which team members complement and nourish each other in a healthy way. But such places seem like very rare occurrences. To me it isn't even feasible to chase after such outliers. I believe such clusters of like-minded people happen organically, in which case there is no point in looking for our dream positions. Could it be that we just have to keep developing our skills and the right group of people will eventually find us?",{"title":7,"searchDepth":62,"depth":62,"links":63},2,[64,65,66],{"id":23,"depth":14,"text":27},{"id":36,"depth":14,"text":39},{"id":52,"depth":14,"text":55},"markdown","content:blog:the-corporate-barrier.md","content","blog/the-corporate-barrier.md","blog/the-corporate-barrier","md",{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":7,"title":8,"description":9,"subtitle":10,"author":11,"slug":12,"publishedDate":13,"updatedAt":13,"length":14,"wordCount":15,"body":74,"_type":67,"_id":68,"_source":69,"_file":70,"_stem":71,"_extension":72},{"type":17,"children":75,"toc":104},[76,80,84,88,92,96,100],{"type":20,"tag":21,"props":77,"children":78},{"id":23},[79],{"type":26,"value":27},{"type":20,"tag":29,"props":81,"children":82},{},[83],{"type":26,"value":33},{"type":20,"tag":21,"props":85,"children":86},{"id":36},[87],{"type":26,"value":39},{"type":20,"tag":29,"props":89,"children":90},{},[91],{"type":26,"value":44},{"type":20,"tag":29,"props":93,"children":94},{},[95],{"type":26,"value":49},{"type":20,"tag":21,"props":97,"children":98},{"id":52},[99],{"type":26,"value":55},{"type":20,"tag":29,"props":101,"children":102},{},[103],{"type":26,"value":60},{"title":7,"searchDepth":62,"depth":62,"links":105},[106,107,108],{"id":23,"depth":14,"text":27},{"id":36,"depth":14,"text":39},{"id":52,"depth":14,"text":55},1764488818199]