[{"data":1,"prerenderedAt":208},["Reactive",2],{"content-query-RHRs4SUCVX":3},[4,88,151],{"_path":5,"_dir":6,"_draft":7,"_partial":7,"_locale":8,"_empty":7,"title":9,"description":10,"subtitle":11,"author":12,"slug":13,"image":14,"alt":15,"attribution":12,"date":16,"updatedAt":16,"length":17,"wordCount":18,"body":19,"_type":83,"_id":84,"_source":85,"_file":86,"_extension":87},"/blog/resisting-the-dark-arts-of-big-sugar","blog",false,"","Resisting The Dark Arts of Big Sugar","Dear creator of the universe, what vicious notion has driven you to bestow us with this plant that is the cocoa tree. Looking at past inventions of yours, you must have been very well aware of the consequences your actions might entail.","On my lifelong struggle with the bittersweet muse","Kilian Kukelka","/resisting-the-dark-arts-of-big-sugar","resisting-the-dark-arts-of-big-sugar","Shelf full of chocolate bars","2023-05-06",9,1747,{"type":20,"children":21,"toc":80},"root",[22,30,35,40,45,50,55,60,65,70,75],{"type":23,"tag":24,"props":25,"children":26},"element","p",{},[27],{"type":28,"value":29},"text","Dear creator of the universe, what vicious notion has driven you to bestow us with this plant that is the cocoa tree. Looking at past inventions of yours, you must have been very well aware of the consequences your actions might entail. Once again, my species’ innate tendency to favour short-term pleasure has set us up to be particularly vulnerable to the addictive properties that lie dormant in its beans. It comes as no surprise that you have chosen for it to be concealed deep within the rainforest’s verdant embrace. Yet even your all-knowing wisdom was unable to foresee mankind's insatiable appetite for more, setting in motion the relentless pursuit to exploit the gift that was given to us.",{"type":23,"tag":24,"props":31,"children":32},{},[33],{"type":28,"value":34},"Fast forward to the here and now, the once innocent fruits of your creation have been taken hostage by the profit-hungry entities that make up the sugar industrial complex. Like with so many other consumable goods that let us temporarily alter our perceived state of being, the opportunistic minds of the corporate world couldn’t help themselves but to start profiting off of our unfortunate evolutionary trait. And it‘s the ease with which they are able to enslave us, that makes it so frustrating to watch our growing inability to cope with the malicious practices found in modern consumer markets. A development that often causes not only our relationship, but our every interaction with food to be a gauntlet of emotions instead of the rewarding experience nature intended it to be.",{"type":23,"tag":24,"props":36,"children":37},{},[38],{"type":28,"value":39},"The constant access thereof, a condition our ancestors would have welcomed with open hands, now puts us in the awkward position of having to actively restrain our primal instincts from making us ingest piles of sweet tasting, high-caloric landfill material. It is rather ironic how the very mechanisms that enabled humanity to flourish are now deliberately weaponized against it, all to impress some corporate suits in the next quarterly earnings call.",{"type":23,"tag":24,"props":41,"children":42},{},[43],{"type":28,"value":44},"Makes you wonder how we got this far in the first place. When the same organ that can come up with the concept of a rocket engine will gladly throw out its last bit of dignity just to get a taste of Ritter Sport‘s newly released Crispy Banana flavor. Apparently it’s as easy as mixing the ground cocoa seeds with a bunch of milk-based derivatives and the crystallized nectar of the sugarcane for them to obtain the key to our hearts.",{"type":23,"tag":24,"props":46,"children":47},{},[48],{"type":28,"value":49},"By flooding the shelves with sheer endless variations of this good, products of all shapes and colors and flavors and sizes, catered to every age group and lifestyle and season of the year, the modern consumer is almost held at gunpoint whenever they are forced to pass through the vast and enticing candy aisle on their way to the checkout. Be it as a gift for a loved one or as a cure for one of those moody days, it’s allure has captivated the hearts and souls of most everyone around us. Even myself, a person I‘d consider rather disciplined and thoughtful in their actions, occasionally will give into the seductive whispers of the bittersweet muse.",{"type":23,"tag":24,"props":51,"children":52},{},[53],{"type":28,"value":54},"One manufacturer in particular, a small German brand by the name of Meybona, has managed to craft a blend that has captivated my taste buds from the very first bite. Despite its pretty high cocoa content of around 85%, typically resulting in a taste profile consisting mostly of bitter and earthy notes, the bar not only manages to pull off the soft creamy texture of its milk-based siblings, but also overwhelmed me with its surprisingly sweet aroma. So much so that it had me check the food label twice. I couldn’t fathom how this thing was supposed to contain only 14 grams of sugar, but there was no trickery to be found. Just 5 simple ingredients, consisting of sugar, vanilla and various cocoa solids, with no trace of artificial sweeteners in sight. A showcase of true craftsmanship.",{"type":23,"tag":24,"props":56,"children":57},{},[58],{"type":28,"value":59},"Just this Saturday I‘ve devoured one of them in a record time of 3 minutes and 25 seconds. Perhaps I should bring to your attention that I didn’t try to set a new record (low) for myself here. It’s that my body has developed this weird talent to almost accurately synchronize the time it requires to ingest a given meal with the exact episode length of whatever tv show I happen to watch at that moment. The 3 minutes and 25 seconds was what’s left of an episode of Southpark I had started watching earlier that day. Currently catching up on the latest season. I have to say that I’m quite disappointed by the lackluster content of recent seasons. What I used to consider the pinnacle of thought-provoking satire and social commentary, nowadays often fails to live up to its former glory, effectively turning the show into nothing more than a lazy recapitulation of current events.\nAnywho, thanks to my inner demons, I couldn’t just watch the rest of the episode like a normal person would do. No, I needed to superset the given visual experience with yet another hedonistic stimulus. My rational is being hijacked by my insatiable cravings for that sweet-tasting sensation, despite me being fully aware of the ramifications such actions will have on my overall well-being. The slightly frantic state it leaves me in, the inevitable effect it will have one my sleep hygiene, the metabolic repercussions of consuming large amounts of highly refined sugar and saturated fats. All of this for a few minutes’ worth of pleasure.",{"type":23,"tag":24,"props":61,"children":62},{},[63],{"type":28,"value":64},"It’s fascinating to observe what lengths my body is willing to go to just so it can experience a bunch of glucose molecules rushing through its bloodstream, reminiscent of Hollywood’s depiction of a heroine addict looking for his next fix. You’d think I was exaggerating here, but during my first few years at university, I genuinely struggled to maintain a grip on my self-control. To a point at which 3 bars of chocolate a day had become the norm. Even if it was way past closing time of any nearby convenience store, I‘d always find a way to get my daily dose of sugar. Whether that meant stopping by some random gas station in the middle of nowhere (mind you I don’t own a car), or making the pilgrimage to a 24/7 supermarket at the nearest train station. None of which are locations you want to find yourself at in the middle of the night. The scenery, composed mostly of functional alcoholics, stranded tourists and pale-skinned night shift workers, was sorrowing at best. That didn’t stop me, however, from becoming a regular visitor of said establishments. On a good day, I settled with 2 bars of Milka, with at least one of them having to be the flavor featuring Lefèvre-Utile biscuits inside. The one with the prominent red-coloured wave on its packaging. If I had to choose, I‘d make it my contestant for the greatest food brand collaboration in existence. 87 grams of perfection. My favorite part was to nibble off the chocolate that surrounded each of the buscuit pieces. Saving up the salty parts for last gave me the needed palette cleanse to not get fatigued by the tidal wave of sweetness that had just swept through my mouth.",{"type":23,"tag":24,"props":66,"children":67},{},[68],{"type":28,"value":69},"What was initially thought of as a way of rewarding myself for surviving yet another day in the shit show that is the academic system, gradually evolved into a toxic habit that seized control of my daily life. While I perfectly well understood that my excessive consumption habits would eventually take a toll on my well-being, I was past the point at which I could still bargain with my inner voice. It took a series of rather serious health complications for me to muster enough willpower to finally break free from my compulsive behaviour. And although I emerged victorious from this battle, my sweet tooth has yet to be defeated.",{"type":23,"tag":24,"props":71,"children":72},{},[73],{"type":28,"value":74},"No matter which sin of the culinary world I‘m up against - be it sugary treats, salty snacks, or deep-fried delicacies - the common thread they share is the way in which they interfere with my reward mechanisms. It feels like when faced with situations that guarantee some sort of immediate relieve, the human mind is almost programmed to indulge in the temptation. When looking at the environment our ancestors had to survive in, roaming the planes of the South African wetlands, it stands to reason why we developed such tendencies in the first place. Back then, food was a necessity, rather than the hedonistic activity it has become today. One had to seize every opportunity to obtain sustenance, as scarcity and uncertainty were ever-present. But with the arrival of the Industrial Age, the invention of ever more capable machinery and ultimately the advancements in food manufacturing and preservation, humanity has effectively outpaced the speed of evolution in a matter of centuries. Imposed upon our primal instincts is now the insurmountable task of helping us steer through an environment of overabundance.",{"type":23,"tag":24,"props":76,"children":77},{},[78],{"type":28,"value":79},"Though it should be noted, that this constant availability isn't harmful per se. It was the introduction of highly processed, calorie dense food products into our diet, that has put society into disarray. I know what you might be thinking right now, but i ask you to not let your emotions cloud your judgement. Pointing your finger at the next best industry giant won’t aid you in pulling yourself out of your misery, as the suffering that plagues you is entirely self-inflicted. At its core, the modern culinary landscape is nothing more than a reflection of the collective demand. If you ever wondered why something like Hershey‘s giant 5 pound bar exists, it is because someone is willing to pay money for it. That’s just how consumer markets tend to work. Way more interesting to decipher are the motivational factors behind such purchases, which are rooted deeply in the way in which Western society puts consumerism above all. A mental construct that has been fed to the masses since the 18th century, as a means to counteract the overproduction of goods. Ever since, our day-to-day life and social norms have been meticulously tailored to fit this given narrative, making us utilize the act of consumption as a coping mechanism to fill the void that everyday life leaves us with. Wouldn't it be wonderful if simply being conscious of this predicament was enough to break free from it? Yet here I stand, with a bar of chocolate in my shopping bag.",{"title":8,"searchDepth":81,"depth":81,"links":82},2,[],"markdown","content:blog:resisting-the-dark-arts-of-big-sugar.md","content","blog/resisting-the-dark-arts-of-big-sugar.md","md",{"_path":89,"_dir":6,"_draft":7,"_partial":7,"_locale":8,"_empty":7,"title":90,"description":91,"subtitle":92,"author":12,"slug":93,"image":94,"alt":95,"attribution":96,"date":97,"updatedAt":97,"length":98,"wordCount":99,"body":100,"_type":83,"_id":149,"_source":85,"_file":150,"_extension":87},"/blog/dantes-journey-through-modern-gastronomy","Dante's Journey Through Modern Gastronomy","After binge-eating my way out of the state of starvation I was afflicted with coming home from my latest fine-dining adventure, I felt an urgency to reflect upon this both obscure yet fascinating experience of mine.","Recapitulating my latest encounter with the obscure world of fine dining.","/dantes-journey-through-modern-gastronomy","dantes-journey-through-modern-gastronomy","Joseph Anton Koch, inferno, 1825-28, 05 cerbero","Sailko, \u003Ca href=\"https://creativecommons.org/licenses/by/3.0\" target=\"_blank\" class=\"hover:underline\">CC BY 3.0\u003C/a>, via Wikimedia Commons","2023-02-18",5,1273,{"type":20,"children":101,"toc":147},[102,107,112,117,122,127,132,137,142],{"type":23,"tag":24,"props":103,"children":104},{},[105],{"type":28,"value":106},"After binge-eating my way out of the state of starvation I was afflicted with coming home from my latest fine-dining adventure, I felt an urgency to reflect upon this both obscure yet fascinating experience of mine. An experience only made possible thanks to the hedonistic treasure trove that is our beloved late-stage capitalism. It’s like us Westerners can’t help ourselves but to take consumerism to a degree at which it starts to become a parody of itself. We’ve managed to morph something as mundane as the act of food consumption into a classist system of oppression. In our modern-day food culture mere eating is to be considered an activity for peasants. Only those of us who’ve acquired the necessary financial means are worthy of participating in the world of dining. But I believe I’m getting ahead of myself here. Loosing myself in hyperbolic statements before the story has even begun.",{"type":23,"tag":24,"props":108,"children":109},{},[110],{"type":28,"value":111},"It all started with an innocent text message by a dear friend of mine, asking me if I would like to join her and her friends for dinner the day before her long-planned birthday celebration. It was very unlike me to just blindly accept this last-minute invitation without doing my fair share of meticulous research into what was going to await me, but my friend’s proven track record of memorable restaurant choices gave me enough of a push to move me out of my comfort zone. That, and the district it was located in, known for its flourishing food culture and hidden gastronomic gems.",{"type":23,"tag":24,"props":113,"children":114},{},[115],{"type":28,"value":116},"Upon entering the establishment I was welcomed by an upbeat staff who, after giving him the name the reservation was under, guided me to a secluded, more private part of the restaurant which we accessed by taking a small detour through the winter garden. Mesmerised by the imposing decor of the interior I took a seat at the head of the table. Put on display on the wall next to me, a rich palette of liquors and numerous bottles of their house wine. Humongous jars filled with pickled chickpeas and red beets were placed all throughout the room.",{"type":23,"tag":24,"props":118,"children":119},{},[120],{"type":28,"value":121},"As I was the first one to arrive, aware of my indecisive nature, I used the time to take an initial glance the menu. It took me a moment to open it as my hands were still slightly numb from the snowstorm that swept through the city. Sifting through the first few pages it dawned upon me what I’ve manoeuvred myself into. This wasn’t just your average woke fusion kitchen. This was meant to be an experience. A culinary triathlon if you will. My curiosity, however, faded away in an instant when I came to realise that none of their multi course meals were suitable for devout followers of a plant based diet. It was at this moment that the rest of the party arrived. The waiter was quick to take our orders, but before we could even say a word, we were being subjected to a 5 minute monologue about the exquisite selection of drinks that they had in store for us. The brash and presumptuous undertone to his suggestions was so blatantly obvious that I couldn’t even be mad about it. And to his defence, he was nothing but a pawn in the game of chess that had been going on since the moment I had stepped foot into the place. Frustrated by the limited set of options to choose from, I simply opted for the first vegan item I could find in the menu.",{"type":23,"tag":24,"props":123,"children":124},{},[125],{"type":28,"value":126},"The level of frustration I felt when the food finally arrived was just equally as bad. What I was presented with was a tiny portion of cauliflower florets, a few pieces of pumpernickel bread, drenched in a thick, hollandaise-like sauce. Sprinkled on top, a handful of hazelnuts and two strings of saffron. I didn’t even mind that most of the meal was served cold. After all, gas prices had been surging throughout the past year. What did bewilder me though was the taste of the food, or rather the lack thereof. Hear me out, I really gave it a shot. I genuinely was looking forward to experience the culinary sensation I was being sold on. First I mixed the hazelnuts with the cauliflower, then with the bread, then all of them together in a single bite. Sure, some of the combinations of flavours may be described as peculiar and even mildly interesting, but ultimately I was left puzzled at how a human above the age of five would be able to derive any form of pleasure from this pile of seemingly arbitrary ingredients.",{"type":23,"tag":24,"props":128,"children":129},{},[130],{"type":28,"value":131},"Even my trip to the mens room was more of a revelation than the food I just had ingested, as I happened to eavesdrop on one of the tables I passed by. The couple had just been handed their receipt. A whopping sum of 240€. Two hundred forty euros! Have these two gentlemen been inhaling gold dust for the past 2 hours? I guess part of this financial abuse is being accounted for when being told by the minimum wage waitress how the minuscule slice of wagyu beef had been hand-massaged by a cohort of Tibetan monks before being flown half across the globe just to be devoured by a twenty-something year old junior business consultant with a self-acclaimed interest for fine dining despite ever having touched his 500$ Japanese knife set he bought himself for Christmas.",{"type":23,"tag":24,"props":133,"children":134},{},[135],{"type":28,"value":136},"I returned from my roundtrip shortly after. Just in time for dessert. Of course, the way in which the dishes were served also had to have some sort of „creative“ spin to it. What resulted could have been a scene out of a David Lynch movie. The appearance was almost as insulting as the food itself. The peach-coloured sorbet was to be eaten out of a tiny aluminium can, which originally was used as a storage container for sun-dried tomatoes. How do I know? Well, the hideous looking label of some no-name Slavic food producer still was attached to it. Presumably the chef’s attempt to convey a sense of frugality or pragmatism. Anywho - there I was with this ominous looking can and the sorbet inside of it. The latter looking like the partially digested form of what was initially kept in the former. To my surprise, it did in fact taste like peaches.",{"type":23,"tag":24,"props":138,"children":139},{},[140],{"type":28,"value":141},"Once again, I found myself dumbfounded by my inability to parse the world the way other people did. Could it have been the case that it was me who was lacking the sensibility to truly appreciate the level of craftsmanship that I was presented with? But how? Not to sound brash here, but I would consider my sense of taste as rather developed. I love to eat. I love to cook. And I enjoy experimenting with the way I prepare my food. Every meal of mine is treated like a ritual and if I’m being honest, food is the only thing in life that I truly appreciate and look forward to.",{"type":23,"tag":24,"props":143,"children":144},{},[145],{"type":28,"value":146},"It rather appears to me that frequent guests of such establishments take the hefty price tag as a means to justify that what they just shoved down their throat must have been a moment of culinary excellence. I hate to break it to you, but if your eating habits revolve around DoorDash, the local Starbucks drive-in and your vocal distaste for „Chinese food“, I can see how such mediocre prepared meals might lead you to believe that your sensations were somewhat profound. To be fair, leaving a restaurant with a growling stomach definitely IS an experience to be remembered.",{"title":8,"searchDepth":81,"depth":81,"links":148},[],"content:blog:dantes-journey-through-modern-gastronomy.md","blog/dantes-journey-through-modern-gastronomy.md",{"_path":152,"_dir":6,"_draft":7,"_partial":7,"_locale":8,"_empty":7,"title":153,"description":154,"subtitle":155,"author":12,"slug":156,"image":157,"date":158,"updatedAt":158,"length":159,"wordCount":160,"body":161,"_type":83,"_id":206,"_source":85,"_file":207,"_extension":87},"/blog/on-my-relationship-with-painting","On My Relationship With Painting","The time has come to dissect an issue that has been plaguing my mind for far too long. A question that is very close to my heart. Perhaps too close to even make a rational assessment about what is truly going on behind my ego-tinted glasses. But I'm certain that if I don’t take action now, every day that goes by will just be another attempt to catch my own tail.","An attempt to reflect on my distorted relationship with the craft I so deeply admire.","/on-my-relationship-with-painting","on-my-relationship-with-painting","2022-10-02",8,833,{"type":20,"children":162,"toc":201},[163,170,175,180,186,191,196],{"type":23,"tag":164,"props":165,"children":167},"h3",{"id":166},"the-absence-of-fun",[168],{"type":28,"value":169},"The Absence of Fun",{"type":23,"tag":24,"props":171,"children":172},{},[173],{"type":28,"value":174},"The time has come to dissect an issue that has been plaguing my mind for far too long. A question that is very close to my heart. Perhaps too close to even make a rational assessment about what is truly going on behind my ego-tinted glasses. But I'm certain that if I don’t take action now, every day that goes by will just be another attempt to catch my own tail. Putting my thoughts and emotions down into words seems like the only valid approach to finally come to peace with my inner demon. The issue at hand, and the very topic I seek to deconstruct throughout writing this essay, is my relationship with painting. Somewhere along the way of acquiring this new skill of mine, I've somehow managed to turn this most sacred form of expression into an act of desperation. A misconfiguration of sorts, disabling me from experiencing the true nature of the craft.",{"type":23,"tag":24,"props":176,"children":177},{},[178],{"type":28,"value":179},"The root cause for this crisis of mine is that no matter from which angle I choose to approach the subject, I simply cannot seem to find enjoyment in the activity. Sure, on the occasion there comes a moment that could be described as a feeling of proudness or a sense of accomplishment, yet they are spread so sparsely that I have a hard time coping with the dry spells that come in between. Hence, the artistic journey has become somewhat of an uphill battle to me, with the only thing keeping me going being the satisfaction I receive upon finishing a piece. Throughout the process itself, however, I either find myself in a state of complete apathy or at the beginning of a nervous breakdown. At first I thought this to be just the initial barrier one typically faces when picking up something new. Though after now two years of trial and error, I've come to the sobering realisation that my disconnectedness to the craft cannot be simply ascribed to a lack of proficiency or discipline, but emerges from the depths of my inner workings and the way I naturally tend to interface with the world.",{"type":23,"tag":164,"props":181,"children":183},{"id":182},"creative-deconstruction",[184],{"type":28,"value":185},"Creative Deconstruction",{"type":23,"tag":24,"props":187,"children":188},{},[189],{"type":28,"value":190},"What exactly is it that pushes me to pick up my pen if I know for certain that all I'm going to be faced with is a barricade of boredom and exhaustion? Why is it that I need to force myself to paint, even though I romanticise the idea of being an artist? Writing it out like this is making me question the reason of why I embarked on this journey in the first place. Perhaps the aspiration of becoming this idealised version of myself simply isn't enough of an incitement to keep myself motivated on a long-term basis. It's the emphasis on \"becoming\" that seems to distract me from living in the present moment. A disoriented state of mind that is purely centered around the completion of egocentric objectives, leaving no room to fathom the beauty of the creative process.",{"type":23,"tag":24,"props":192,"children":193},{},[194],{"type":28,"value":195},"If I'm being honest, not a single painting of mine has been started out of necessity to express myself, nor has it served me as an outlet to work through my emotions. That isn’t to say one cannot create in absence of aforementioned reasons. It’s just that for me personally, not having an inherent urge to devote myself to the matter on a day-to-day basis let’s painting become a chore rather than something I look forward to do. What has emerged is a state of disorientation. A toxic cycle that, through its deceptive prospects of fame and success, manages to keep me stuck in place. I genuinely believe, however, that the given situation is not a product of a lack of discipline and that vigorously trying to rewire myself just for the off-chance of finding enjoyment is not to be considered an appropriate response to the dilemma I’m facing. That is because in virtually every other aspect of my life, these character traits of mine give me an edge I don’t want to miss. More often than not, I truly appreciate and welcome the way my brain tends to parse and process my surroundings. My mind is, and always has been, a captive to short-term gratification. Even if that means that my pursuits are primarily guided by shortsighted motives, it is a trait that I don’t want to sacrifice.",{"type":23,"tag":24,"props":197,"children":198},{},[199],{"type":28,"value":200},"Hence, I find myself at a crossroads of either trying to reframe my approach to painting as a whole or to discover a more fitting creative outlet all together. No matter the direction I’m going next, my number one priority is to ensure that I won’t fall into my old patterns of behaviour. To not compromise on my new set goal of finding an activity I enjoy doing regardless of its potential yield or social standing. A process that keeps me stimulated and entertained over long stretches of time, without finding myself in a state of defeat after just a few minutes of engagement.",{"title":8,"searchDepth":81,"depth":81,"links":202},[203,205],{"id":166,"depth":204,"text":169},3,{"id":182,"depth":204,"text":185},"content:blog:on-my-relationship-with-painting.md","blog/on-my-relationship-with-painting.md",1695385886681]