[{"data":1,"prerenderedAt":160},["Reactive",2],{"content-query-RHRs4SUCVX":3},[4,47,98],{"_path":5,"_dir":6,"_draft":7,"_partial":7,"_locale":8,"title":9,"description":10,"subtitle":11,"author":12,"slug":13,"image":14,"alt":15,"attribution":12,"publishedDate":16,"updatedAt":16,"length":17,"wordCount":18,"body":19,"_type":42,"_id":43,"_source":44,"_file":45,"_extension":46},"/blog/beyond-pastels-and-tremolos","blog",false,"","Beyond Pastels and Tremolos","While only 29 years of age, at times, it feels like I’ve surmounted three lifetimes’ worth of creative exploration already.","My newfound love for the written word","Kilian Kukelka","/beyond-pastels-and-tremolos","beyond-pastels-and-tremolos","Minimal writing setup","2023-10-12",2,476,{"type":20,"children":21,"toc":40},"root",[22,30,35],{"type":23,"tag":24,"props":25,"children":26},"element","p",{},[27],{"type":28,"value":29},"text","While only 29 years of age, at times, it feels like I’ve surmounted three lifetimes’ worth of creative exploration already. This all thanks to my most curious and indecisive nature, making life appear as if it were an all-inclusive buffet, presenting me with a myriad of delicacies I have yet to indulge in. From the humble beginnings of me wanting to become a composer for TV and film, to my unavailing odyssey through the mysterious realms of painting, it is now that I find myself sitting here at my desk, with nothing but a pen and a blank piece of paper lying in front of me. I assume it’s this very simplicity, the ease with which one is able to engage with the craft, that ultimately drew me to field of writing.",{"type":23,"tag":24,"props":31,"children":32},{},[33],{"type":28,"value":34},"Gone were the days of patiently tuning the strings on my guitar, meticulously cleaning paint brushes with brain-fog-inducing solvents, soundproofing the interior of my bedroom to get rid of its echo-y sound, spendings days of research on what type of microphone to buy or which brand of oil colors to pour my money into. Unlike its rather demanding siblings, the medium of writing is surprisingly easy to please. As long as you have a pulse and bring along some basic knowledge of the English grammar, you are free to express whatever you deem worthwhile. Whether I am doing my laundry or waiting in line at the grocery store, its omnipresence accompanies my every waking moment. Being able to revise and refine my stories within the comfort of my own head poses an unparalleled level of creative freedom that defies the rules and constraints of the physical world.",{"type":23,"tag":24,"props":36,"children":37},{},[38],{"type":28,"value":39},"With this newfound love for the written word, also emerged an appreciation for the plethora of concepts and ideas that spring from our imagination. My inner dialogues have become more than mere fleeting thoughts. Something precious — something to cherish — something that I must hold on to at all costs. I now find myself in obeisance to a higher power, urging me to transcribe, document, and collect any crumb of inspiration life chooses to throw my way. So much so, that I do not dare to leave my apartment without carrying some sort of notebook with me. Scattered across my room, pages upon pages filled with unfinished short stories and uncharted narratives. Hundreds of hastily-typed notes collecting virtual dust on my phone. While every now and then, this compulsion of mine can feel somewhat burdensome and exhausting, given a society of excess and overabundance, what more could one ask for than a sense of necessity? When a particular constellation of words or a most poignant way to describe, makes you leap out of bed in the middle of the night, determined to save it from forever being lost in the boundless void of the human mind.",{"title":8,"searchDepth":17,"depth":17,"links":41},[],"markdown","content:blog:beyond-pastels-and-tremolos.md","content","blog/beyond-pastels-and-tremolos.md","md",{"_path":48,"_dir":6,"_draft":7,"_partial":7,"_locale":8,"title":49,"description":50,"subtitle":51,"author":12,"slug":52,"publishedDate":53,"updatedAt":53,"length":54,"wordCount":55,"body":56,"_type":42,"_id":96,"_source":44,"_file":97,"_extension":46},"/blog/craving-artistic-fulfillment","Craving Artistic Fulfillment","Having now spent 18 months in the professional world of web development, the initial glamour of novelty has started to fade away. What first felt like a breath of fresh air in regard to nourishing my creative needs has turned out the be a predictable process shaped by the rules of a predefined design system.","Coping with the emptiness of functional design","/craving-artistic-fulfillment","2021-01-03",5,475,{"type":20,"children":57,"toc":91},[58,65,70,75,81,86],{"type":23,"tag":59,"props":60,"children":62},"h3",{"id":61},"design-systems",[63],{"type":28,"value":64},"Design systems",{"type":23,"tag":24,"props":66,"children":67},{},[68],{"type":28,"value":69},"Having now spent 18 months in the professional world of web development, the initial glamour of novelty has started to fade away. What first felt like a breath of fresh air in regard to nourishing my creative needs has turned out the be a predictable process shaped by the rules of a predefined design system. Every decision about the project can be derived from this system. My thoughts have to conform to the aesthetic boundaries of the given guidelines. One may even call it declarative design. A definitive description of the desired outcome. An approach that is rock solid and inerrant once its user has mastered the tools of the trade.",{"type":23,"tag":24,"props":71,"children":72},{},[73],{"type":28,"value":74},"The only time questions arise is when you want to explore spaces beyond such principles. But even then, the fundamental building blocks on which you can build upon are already set. There is no room for creative destruction, nor the incentive to overthrow a working system. And why should there be? This underlying structure is a vehicle for sustaining a stable cash flow. It acts as a visual outlet for the company's values and therefore has to portray a certain level of realiability and professionality. Every notion that has the potential to obscure this image will be rejected throughout the planning stages, while future design choices will be based on objective metrics deduced from A/B-testing and key perfomance indicators. And the only way to come to peace with this objective overlord is to surrender",{"type":23,"tag":59,"props":76,"children":78},{"id":77},"the-price-of-reliability",[79],{"type":28,"value":80},"The price of reliability",{"type":23,"tag":24,"props":82,"children":83},{},[84],{"type":28,"value":85},"While this logical way of translating ideas into reality has a beauty of its own, it’s practical use in the world of frontend engineering has shown to be limited when aiming for creative fullfilment. The purpose of a design formulated in such a way is purely functional in nature and therefore has a hard time standing on its own. Its aesthetic value always coexists in relation to a specific product or service, with the goal of increasing a predefined set of key performance indicators.",{"type":23,"tag":24,"props":87,"children":88},{},[89],{"type":28,"value":90},"When you spend the greater part of your week with the creation and optimization of purely functional designs, you sooner or later arrive at a point where you start to question the purpose of your creations. A potential turning point that aids you in prevailing your artistic identity. But sometimes it's hard to navigate in these murky waters, as the process on its own can be in fact engaging and rewarding. It is the result that leaves no room for the expression of oneself. The decision making process in this respect is based on logic rather than emotion and intuition. It feels like the more time I spend pursuing this way of approaching creativity, the harder it gets to tap into my inner self. All I want is to be blindfolded again. Trapped in the mace of my own naivite.",{"title":8,"searchDepth":17,"depth":17,"links":92},[93,95],{"id":61,"depth":94,"text":64},3,{"id":77,"depth":94,"text":80},"content:blog:craving-artistic-fulfillment.md","blog/craving-artistic-fulfillment.md",{"_path":99,"_dir":6,"_draft":7,"_partial":7,"_locale":8,"title":100,"description":101,"subtitle":102,"author":12,"slug":103,"image":104,"alt":105,"attribution":106,"publishedDate":107,"updatedAt":107,"length":54,"wordCount":108,"body":109,"_type":42,"_id":158,"_source":44,"_file":159,"_extension":46},"/blog/dantes-journey-through-modern-gastronomy","Dante's Journey Through Modern Gastronomy","After binge-eating my way out of the state of starvation I was afflicted with coming home from my latest fine-dining adventure, I felt an urgency to reflect upon this both obscure yet fascinating experience of mine.","Recapitulating my latest encounter with the obscure world of fine dining.","/dantes-journey-through-modern-gastronomy","dantes-journey-through-modern-gastronomy","Joseph Anton Koch, inferno, 1825-28, 05 cerbero","Sailko, \u003Ca href=\"https://creativecommons.org/licenses/by/3.0\" target=\"_blank\" class=\"hover:underline\">CC BY 3.0\u003C/a>, via Wikimedia Commons","2023-02-18",1273,{"type":20,"children":110,"toc":156},[111,116,121,126,131,136,141,146,151],{"type":23,"tag":24,"props":112,"children":113},{},[114],{"type":28,"value":115},"After binge-eating my way out of the state of starvation I was afflicted with coming home from my latest fine-dining adventure, I felt an urgency to reflect upon this both obscure yet fascinating experience of mine. An experience only made possible thanks to the hedonistic treasure trove that is our beloved late-stage capitalism. It’s like us Westerners can’t help ourselves but to take consumerism to a degree at which it starts to become a parody of itself. We’ve managed to morph something as mundane as the act of food consumption into a classist system of oppression. In our modern-day food culture mere eating is to be considered an activity for peasants. Only those of us who’ve acquired the necessary financial means are worthy of participating in the world of dining. But I believe I’m getting ahead of myself here. Loosing myself in hyperbolic statements before the story has even begun.",{"type":23,"tag":24,"props":117,"children":118},{},[119],{"type":28,"value":120},"It all started with an innocent text message by a dear friend of mine, asking me if I would like to join her and her friends for dinner the day before her long-planned birthday celebration. It was very unlike me to just blindly accept this last-minute invitation without doing my fair share of meticulous research into what was going to await me, but my friend’s proven track record of memorable restaurant choices gave me enough of a push to move me out of my comfort zone. That, and the district it was located in, known for its flourishing food culture and hidden gastronomic gems.",{"type":23,"tag":24,"props":122,"children":123},{},[124],{"type":28,"value":125},"Upon entering the establishment I was welcomed by an upbeat staff who, after giving him the name the reservation was under, guided me to a secluded, more private part of the restaurant which we accessed by taking a small detour through the winter garden. Mesmerised by the imposing decor of the interior I took a seat at the head of the table. Put on display on the wall next to me, a rich palette of liquors and numerous bottles of their house wine. Humongous jars filled with pickled chickpeas and red beets were placed all throughout the room.",{"type":23,"tag":24,"props":127,"children":128},{},[129],{"type":28,"value":130},"As I was the first one to arrive, aware of my indecisive nature, I used the time to take an initial glance the menu. It took me a moment to open it as my hands were still slightly numb from the snowstorm that swept through the city. Sifting through the first few pages it dawned upon me what I’ve manoeuvred myself into. This wasn’t just your average woke fusion kitchen. This was meant to be an experience. A culinary triathlon if you will. My curiosity, however, faded away in an instant when I came to realise that none of their multi course meals were suitable for devout followers of a plant based diet. It was at this moment that the rest of the party arrived. The waiter was quick to take our orders, but before we could even say a word, we were being subjected to a 5 minute monologue about the exquisite selection of drinks that they had in store for us. The brash and presumptuous undertone to his suggestions was so blatantly obvious that I couldn’t even be mad about it. And to his defence, he was nothing but a pawn in the game of chess that had been going on since the moment I had stepped foot into the place. Frustrated by the limited set of options to choose from, I simply opted for the first vegan item I could find in the menu.",{"type":23,"tag":24,"props":132,"children":133},{},[134],{"type":28,"value":135},"The level of frustration I felt when the food finally arrived was just equally as bad. What I was presented with was a tiny portion of cauliflower florets, a few pieces of pumpernickel bread, drenched in a thick, hollandaise-like sauce. Sprinkled on top, a handful of hazelnuts and two strings of saffron. I didn’t even mind that most of the meal was served cold. After all, gas prices had been surging throughout the past year. What did bewilder me though was the taste of the food, or rather the lack thereof. Hear me out, I really gave it a shot. I genuinely was looking forward to experience the culinary sensation I was being sold on. First I mixed the hazelnuts with the cauliflower, then with the bread, then all of them together in a single bite. Sure, some of the combinations of flavours may be described as peculiar and even mildly interesting, but ultimately I was left puzzled at how a human above the age of five would be able to derive any form of pleasure from this pile of seemingly arbitrary ingredients.",{"type":23,"tag":24,"props":137,"children":138},{},[139],{"type":28,"value":140},"Even my trip to the mens room was more of a revelation than the food I just had ingested, as I happened to eavesdrop on one of the tables I passed by. The couple had just been handed their receipt. A whopping sum of 240€. Two hundred forty euros! Have these two gentlemen been inhaling gold dust for the past 2 hours? I guess part of this financial abuse is being accounted for when being told by the minimum wage waitress how the minuscule slice of wagyu beef had been hand-massaged by a cohort of Tibetan monks before being flown half across the globe just to be devoured by a twenty-something year old junior business consultant with a self-acclaimed interest for fine dining despite ever having touched his 500$ Japanese knife set he bought himself for Christmas.",{"type":23,"tag":24,"props":142,"children":143},{},[144],{"type":28,"value":145},"I returned from my roundtrip shortly after. Just in time for dessert. Of course, the way in which the dishes were served also had to have some sort of „creative“ spin to it. What resulted could have been a scene out of a David Lynch movie. The appearance was almost as insulting as the food itself. The peach-coloured sorbet was to be eaten out of a tiny aluminium can, which originally was used as a storage container for sun-dried tomatoes. How do I know? Well, the hideous looking label of some no-name Slavic food producer still was attached to it. Presumably the chef’s attempt to convey a sense of frugality or pragmatism. Anywho - there I was with this ominous looking can and the sorbet inside of it. The latter looking like the partially digested form of what was initially kept in the former. To my surprise, it did in fact taste like peaches.",{"type":23,"tag":24,"props":147,"children":148},{},[149],{"type":28,"value":150},"Once again, I found myself dumbfounded by my inability to parse the world the way other people did. Could it have been the case that it was me who was lacking the sensibility to truly appreciate the level of craftsmanship that I was presented with? But how? Not to sound brash here, but I would consider my sense of taste as rather developed. I love to eat. I love to cook. And I enjoy experimenting with the way I prepare my food. Every meal of mine is treated like a ritual and if I’m being honest, food is the only thing in life that I truly appreciate and look forward to.",{"type":23,"tag":24,"props":152,"children":153},{},[154],{"type":28,"value":155},"It rather appears to me that frequent guests of such establishments take the hefty price tag as a means to justify that what they just shoved down their throat must have been a moment of culinary excellence. I hate to break it to you, but if your eating habits revolve around DoorDash, the local Starbucks drive-in and your vocal distaste for „Chinese food“, I can see how such mediocre prepared meals might lead you to believe that your sensations were somewhat profound. To be fair, leaving a restaurant with a growling stomach definitely IS an experience to be remembered.",{"title":8,"searchDepth":17,"depth":17,"links":157},[],"content:blog:dantes-journey-through-modern-gastronomy.md","blog/dantes-journey-through-modern-gastronomy.md",1697785954407]