[{"data":1,"prerenderedAt":121},["Reactive",2],{"/blog/the-gamble-of-excess":3,"content-query-gXIybTkZ1D":80},{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":7,"title":8,"description":9,"subtitle":10,"author":11,"slug":12,"publishedDate":13,"updatedAt":13,"length":14,"wordCount":15,"body":16,"_type":75,"_id":76,"_source":77,"_file":78,"_extension":79},"/blog/the-gamble-of-excess","blog",false,"","The Gamble of Excess","Who would have thought that having all 6 seasons of House of Cards at ones fingertips could turn out be the tipping point for ones sanity.","Being a completionist in a world of streaming services","Kilian Kukelka","/the-gamble-of-excess","2020-08-09",3,540,{"type":17,"children":18,"toc":69},"root",[19,28,34,40,53,58,64],{"type":20,"tag":21,"props":22,"children":24},"element","h3",{"id":23},"six-seasons",[25],{"type":26,"value":27},"text","Six seasons",{"type":20,"tag":29,"props":30,"children":31},"p",{},[32],{"type":26,"value":33},"Who would have thought that having all 6 seasons of House of Cards at ones fingertips could turn out be the tipping point for ones sanity. I love the feeling of finishing things. Whether its of artificial nature like collecting x amount of y in a video game, or the the completion of this very essay. But when it gets to passive activities such as watching Netflix, something doesn't seem to work as intended in the mess called my brain.",{"type":20,"tag":21,"props":35,"children":37},{"id":36},"the-gamble-of-excess",[38],{"type":26,"value":39},"The gamble of excess",{"type":20,"tag":29,"props":41,"children":42},{},[43,45,51],{"type":26,"value":44},"The pattern starts out very innocent. I scroll through the seemingly endless stream of content. Sometimes something will peak my interest, sometimes I just add another semi-interesting thing that I'll probably never consume to my watchlist. But hey, whats that?! A notification on the bell-thingie. I better get ready for the latest iteration of ",{"type":20,"tag":46,"props":47,"children":48},"em",{},[49],{"type":26,"value":50},"Insert Scandinavian Detective Duo",{"type":26,"value":52},".\nRarely it turns out to be a gem. Which I welcome. The occassional \"healthy\" binge that keeps you at the edge of your seat.\nMost of the time, however, 3 episodes in the show unmasks itself as the same bland, no-brand coffee capsule you cram into your Pixie machine every morning. Just enough of a push to get you going. You just wanna escape for an hour. Who can blame you?",{"type":20,"tag":29,"props":54,"children":55},{},[56],{"type":26,"value":57},"Now it's 9 p.m. and I realize what monstrosity I have awoken. I ESC out of fullscreen mode to take a glance at the progress bar (I honestly don't know what it's called ... yes, thats the quality you get when hiring a Junior Frontend Dev in 2020 ). Shit, I'm only halfway through this mess. What have I done? And then the feeling of failure slowly starts kreeping into my consciousness. Telling myself that I don't have the willpower to finish this damn thing. Knowing that I already invested hours of my life into this show. I don't know what part of evolution takes over at this point, but I honestly wish I could apply it on other areas of my life. So what happens is that all this morphs into some kind of coping mechanism where my brain comes up with the ingenious strategy to finish the whole season in one sitting in order to be liberated form this burden. This of course comes with the underlying notion of quitting streaming altogether from this day one, which turns out to never be as easy as it seems. The days come where I'm work has torn me down to the point where I cannot resist. And time and time again, I'll power through it. When you keep watching that one show just for the sake of getting it over with, you know something's off.",{"type":20,"tag":21,"props":59,"children":61},{"id":60},"what-comes-next",[62],{"type":26,"value":63},"What comes next",{"type":20,"tag":29,"props":65,"children":66},{},[67],{"type":26,"value":68},"Have I found a solution by now? You wish. At least I managed to stay away from Netflix for a few days now. Next on the hit-list are Twitch and Twitter. As with every big change in one's life, there needs to be a trigger of the same proportions. And currently it seems as if my streaming habbits are'nt spriraling out of control just yet. I still manage to get things done. I still enjoy some of the short term gratification that streaming provides. I just... feel numb.",{"title":7,"searchDepth":70,"depth":70,"links":71},2,[72,73,74],{"id":23,"depth":14,"text":27},{"id":36,"depth":14,"text":39},{"id":60,"depth":14,"text":63},"markdown","content:blog:the-gamble-of-excess.md","content","blog/the-gamble-of-excess.md","md",{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":7,"title":8,"description":9,"subtitle":10,"author":11,"slug":12,"publishedDate":13,"updatedAt":13,"length":14,"wordCount":15,"body":81,"_type":75,"_id":76,"_source":77,"_file":78,"_extension":79},{"type":17,"children":82,"toc":116},[83,87,91,95,104,108,112],{"type":20,"tag":21,"props":84,"children":85},{"id":23},[86],{"type":26,"value":27},{"type":20,"tag":29,"props":88,"children":89},{},[90],{"type":26,"value":33},{"type":20,"tag":21,"props":92,"children":93},{"id":36},[94],{"type":26,"value":39},{"type":20,"tag":29,"props":96,"children":97},{},[98,99,103],{"type":26,"value":44},{"type":20,"tag":46,"props":100,"children":101},{},[102],{"type":26,"value":50},{"type":26,"value":52},{"type":20,"tag":29,"props":105,"children":106},{},[107],{"type":26,"value":57},{"type":20,"tag":21,"props":109,"children":110},{"id":60},[111],{"type":26,"value":63},{"type":20,"tag":29,"props":113,"children":114},{},[115],{"type":26,"value":68},{"title":7,"searchDepth":70,"depth":70,"links":117},[118,119,120],{"id":23,"depth":14,"text":27},{"id":36,"depth":14,"text":39},{"id":60,"depth":14,"text":63},1697785954580]