[{"_path":"/blog/dantes-journey-through-modern-gastronomy","_dir":"blog","_draft":false,"_partial":false,"_locale":"","_empty":false,"title":"Dante's Journey Through Modern Gastronomy","description":"After binge-eating my way out of the state of starvation I was afflicted with coming home from my latest fine-dining adventure, I felt an urgency to reflect upon this both obscure yet fascinating experience of mine.","excerpt":{"type":"root","children":[{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"After binge-eating my way out of the state of starvation I was afflicted with coming home from my latest fine-dining adventure, I felt an urgency to reflect upon this both obscure yet fascinating experience of mine."}]}]},"subtitle":"Recapitulating my latest encounter with the obscure world of fine dining.","author":"Kilian Kukelka","slug":"/dantes-journey-through-modern-gastronomy","image":"dantes-journey-through-modern-gastronomy","date":"2023-02-18","updatedAt":"2023-02-18","length":5,"body":{"type":"root","children":[{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"After binge-eating my way out of the state of starvation I was afflicted with coming home from my latest fine-dining adventure, I felt an urgency to reflect upon this both obscure yet fascinating experience of mine."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"After binge-eating my way out of the state of starvation I was afflicted with coming home from my latest fine-dining adventure, I felt an urgency to reflect upon this both obscure yet fascinating experience of mine. An experience only made possible thanks to the hedonistic treasure trove that is our beloved late-stage capitalism. It’s like us Westerners can’t help ourselves but to take consumerism to a degree at which it starts to become a parody of itself. We’ve managed to morph something as mundane as the act of food consumption into a classist system of oppression. In our modern-day food culture mere eating is to be considered an activity for peasants. Only those of us who’ve acquired the necessary financial means are worthy of participating in the world of dining. But I believe I’m getting ahead of myself here. Loosing myself in hyperbolic statements before the story has even begun."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"It all started with an innocent text message by a dear friend of mine, asking me if I would like to join her and her friends for dinner the day before her long-planned birthday celebration. It was very unlike me to just blindly accept this last-minute invitation without doing my fair share of meticulous research into what was going to await me, but my friend’s proven track record of memorable restaurant choices gave me enough of a push to move me out of my comfort zone. That, and the district it was located in, known for its flourishing food culture and hidden gastronomic gems."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Upon entering the establishment I was welcomed by an upbeat staff who, after giving him the name the reservation was under, guided me to a secluded, more private part of the restaurant which we accessed by taking a small detour through the winter garden. Mesmerised by the imposing decor of the interior I took a seat at the head of the table. Put on display on the wall next to me, a rich palette of liquors and numerous bottles of their house wine. Humongous jars filled with pickled chickpeas and red beets were placed all throughout the room."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"As I was the first one to arrive, aware of my indecisive nature, I used the time to take an initial glance the menu. It took me a moment to open it as my hands were still slightly numb from the snowstorm that swept through the city. Sifting through the first few pages it dawned upon me what I’ve manoeuvred myself into. This wasn’t just your average woke fusion kitchen. This was meant to be an experience. A culinary triathlon if you will. My curiosity, however, faded away in an instant when I came to realise that none of their multi course meals were suitable for devout followers of a plant based diet. It was at this moment that the rest of the party arrived. The waiter was quick to take our orders, but before we could even say a word, we were being subjected to a 5 minute monologue about the exquisite selection of drinks that they had in store for us. The brash and presumptuous undertone to his suggestions was so blatantly obvious that I couldn’t even be mad about it. And to his defence, he was nothing but a pawn in the game of chess that had been going on since the moment I had stepped foot into the place. Frustrated by the limited set of options to choose from, I simply opted for the first vegan item I could find in the menu."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The level of frustration I felt when the food finally arrived was just equally as bad. What I was presented with was a tiny portion of cauliflower florets, a few pieces of pumpernickel bread, drenched in a thick, hollandaise-like sauce. Sprinkled on top, a handful of hazelnuts and two strings of saffron. I didn’t even mind that most of the meal was served cold. After all, gas prices had been surging throughout the past year. What did bewilder me though was the taste of the food, or rather the lack thereof. Hear me out, I really gave it a shot. I genuinely was looking forward to experience the culinary sensation I was being sold on. First I mixed the hazelnuts with the cauliflower, then with the bread, then all of them together in a single bite. Sure, some of the combinations of flavours may be described as peculiar and even mildly interesting, but ultimately I was left puzzled at how a human above the age of five would be able to derive any form of pleasure from this pile of seemingly arbitrary ingredients."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Even my trip to the mens room was more of a revelation than the food I just had ingested, as I happened to eavesdrop on one of the tables I passed by. The couple had just been handed their receipt. A whopping sum of 240€. Two hundred forty euros! Have these two gentlemen been inhaling gold dust for the past 2 hours? I guess part of this financial abuse is being accounted for when being told by the minimum wage waitress how the minuscule slice of wagyu beef had been hand-massaged by a cohort of Tibetan monks before being flown half across the globe just to be devoured by a twenty-something year old junior business consultant with a self-acclaimed interest for fine dining despite ever having touched his 500$ Japanese knife set he bought himself for Christmas."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"I returned from my roundtrip shortly after. Just in time for dessert. Of course, the way in which the dishes were served also had to have some sort of „creative“ spin to it. What resulted could have been a scene out of a David Lynch movie. The appearance was almost as insulting as the food itself. The peach-coloured sorbet was to be eaten out of a tiny aluminium can, which originally was used as a storage container for sun-dried tomatoes. How do I know? Well, the hideous looking label of some no-name Slavic food producer still was attached to it. Presumably the chef’s attempt to convey a sense of frugality or pragmatism. Anywho - there I was with this ominous looking can and the sorbet inside of it. The latter looking like the partially digested form of what was initially kept in the former. To my surprise, it did in fact taste like peaches."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Once again, I found myself dumbfounded by my inability to parse the world the way other people did. Could it have been the case that it was me who was lacking the sensibility to truly appreciate the level of craftsmanship that I was presented with? But how? Not to sound brash here, but I would consider my sense of taste as rather developed. I love to eat. I love to cook. And I enjoy experimenting with the way I prepare my food. Every meal of mine is treated like a ritual and if I’m being honest, food is the only thing in life that I truly appreciate and look forward to."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"It rather appears to me that frequent guests of such establishments take the hefty price tag as a means to justify that what they just shoved down their throat must have been a moment of culinary excellence. I hate to break it to you, but if your eating habits revolve around DoorDash, the local Starbucks drive-in and your vocal distaste for „Chinese food“, I can see how such mediocre prepared meals might lead you to believe that your sensations were somewhat profound. To be fair, leaving a restaurant with a growling stomach definitely IS an experience to be remembered."}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[]}},"_type":"markdown","_id":"content:blog:dantes-journey-through-modern-gastronomy.md","_source":"content","_file":"blog/dantes-journey-through-modern-gastronomy.md","_extension":"md"},{"_path":"/blog/on-my-relationship-with-painting","_dir":"blog","_draft":false,"_partial":false,"_locale":"","_empty":false,"title":"On My Relationship With Painting","description":"The time has come to dissect an issue that has been plaguing my mind for far too long. A question that is very close to my heart. Perhaps too close to even make a rational assessment about what is truly going on behind my ego-tinted glasses. But I'm certain that if I don’t take action now, every day that goes by will just be another attempt to catch my own tail.","excerpt":{"type":"root","children":[{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The time has come to dissect an issue that has been plaguing my mind for far too long. A question that is very close to my heart. Perhaps too close to even make a rational assessment about what is truly going on behind my ego-tinted glasses. But I'm certain that if I don’t take action now, every day that goes by will just be another attempt to catch my own tail."}]}]},"subtitle":"An attempt to reflect on my distorted relationship with the craft I so deeply admire.","author":"Kilian Kukelka","slug":"/on-my-relationship-with-painting","image":"on-my-relationship-with-painting","date":"2022-10-02","updatedAt":"2022-10-02","length":8,"body":{"type":"root","children":[{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The time has come to dissect an issue that has been plaguing my mind for far too long. A question that is very close to my heart. Perhaps too close to even make a rational assessment about what is truly going on behind my ego-tinted glasses. But I'm certain that if I don’t take action now, every day that goes by will just be another attempt to catch my own tail."}]},{"type":"element","tag":"h3","props":{"id":"the-absence-of-fun"},"children":[{"type":"text","value":"The Absence of Fun"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The time has come to dissect an issue that has been plaguing my mind for far too long. A question that is very close to my heart. Perhaps too close to even make a rational assessment about what is truly going on behind my ego-tinted glasses. But I'm certain that if I don’t take action now, every day that goes by will just be another attempt to catch my own tail. Putting my thoughts and emotions down into words seems like the only valid approach to finally come to peace with my inner demon. The issue at hand, and the very topic I seek to deconstruct throughout writing this essay, is my relationship with painting. Somewhere along the way of acquiring this new skill of mine, I've somehow managed to turn this most sacred form of expression into an act of desperation. A misconfiguration of sorts, disabling me from experiencing the true nature of the craft."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The root cause for this crisis of mine is that no matter from which angle I choose to approach the subject, I simply cannot seem to find enjoyment in the activity. Sure, on the occasion there comes a moment that could be described as a feeling of proudness or a sense of accomplishment, yet they are spread so sparsely that I have a hard time coping with the dry spells that come in between. Hence, the artistic journey has become somewhat of an uphill battle to me, with the only thing keeping me going being the satisfaction I receive upon finishing a piece. Throughout the process itself, however, I either find myself in a state of complete apathy or at the beginning of a nervous breakdown. At first I thought this to be just the initial barrier one typically faces when picking up something new. Though after now two years of trial and error, I've come to the sobering realisation that my disconnectedness to the craft cannot be simply ascribed to a lack of proficiency or discipline, but emerges from the depths of my inner workings and the way I naturally tend to interface with the world."}]},{"type":"element","tag":"h3","props":{"id":"creative-deconstruction"},"children":[{"type":"text","value":"Creative Deconstruction"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"What exactly is it that pushes me to pick up my pen if I know for certain that all I'm going to be faced with is a barricade of boredom and exhaustion? Why is it that I need to force myself to paint, even though I romanticise the idea of being an artist? Writing it out like this is making me question the reason of why I embarked on this journey in the first place. Perhaps the aspiration of becoming this idealised version of myself simply isn't enough of an incitement to keep myself motivated on a long-term basis. It's the emphasis on \"becoming\" that seems to distract me from living in the present moment. A disoriented state of mind that is purely centered around the completion of egocentric objectives, leaving no room to fathom the beauty of the creative process."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"If I'm being honest, not a single painting of mine has been started out of necessity to express myself, nor has it served me as an outlet to work through my emotions. That isn’t to say one cannot create in absence of aforementioned reasons. It’s just that for me personally, not having an inherent urge to devote myself to the matter on a day-to-day basis let’s painting become a chore rather than something I look forward to do. What has emerged is a state of disorientation. A toxic cycle that, through its deceptive prospects of fame and success, manages to keep me stuck in place. I genuinely believe, however, that the given situation is not a product of a lack of discipline and that vigorously trying to rewire myself just for the off-chance of finding enjoyment is not to be considered an appropriate response to the dilemma I’m facing. That is because in virtually every other aspect of my life, these character traits of mine give me an edge I don’t want to miss. More often than not, I truly appreciate and welcome the way my brain tends to parse and process my surroundings. My mind is, and always has been, a captive to short-term gratification. Even if that means that my pursuits are primarily guided by shortsighted motives, it is a trait that I don’t want to sacrifice."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Hence, I find myself at a crossroads of either trying to reframe my approach to painting as a whole or to discover a more fitting creative outlet all together. No matter the direction I’m going next, my number one priority is to ensure that I won’t fall into my old patterns of behaviour. To not compromise on my new set goal of finding an activity I enjoy doing regardless of its potential yield or social standing. A process that keeps me stimulated and entertained over long stretches of time, without finding myself in a state of defeat after just a few minutes of engagement."}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[{"id":"the-absence-of-fun","depth":3,"text":"The Absence of Fun"},{"id":"creative-deconstruction","depth":3,"text":"Creative Deconstruction"}]}},"_type":"markdown","_id":"content:blog:on-my-relationship-with-painting.md","_source":"content","_file":"blog/on-my-relationship-with-painting.md","_extension":"md"},{"_path":"/blog/not-playing-by-the-rules","_dir":"blog","_draft":false,"_partial":false,"_locale":"","_empty":false,"title":"Not Playing By The Rules","description":"The lessons you learn from examining your childhood are the most insightful pieces of knowledge to explain the mannerisms of your current self.","excerpt":{"type":"root","children":[{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The lessons you learn from examining your childhood are the most insightful pieces of knowledge to explain the mannerisms of your current self."}]}]},"subtitle":"When the established way just never feels right","author":"Kilian Kukelka","slug":"/not-playing-by-the-rules","date":"2021-10-22","updatedAt":"2021-10-22","length":4,"body":{"type":"root","children":[{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The lessons you learn from examining your childhood are the most insightful pieces of knowledge to explain the mannerisms of your current self."}]},{"type":"element","tag":"h3","props":{"id":"growing-up"},"children":[{"type":"text","value":"Growing up"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Lately I've been talking a lot with my mother about me growing up and my childhood in general. What I've picked up on throughout these conversations is a certain characteristic of mine that is still following me to this day. It is my inability to play by the rules. Wether it was about learning how to tie one's shoes or how to fold a shirt, I was never able to see a reason to follow the established way of doing things. Not as a rebellion against my parents. I just did things the way they felt natural to me. Even though it was shown to me how to supposedly do tasks the \"right\" way, I never stuck to it."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"This became very apparent once I started attending elementary school. I hated being told what to learn. I hated having to be present in a specific room in a certain time of the day for this period of time. I hated being there in general. I remember being sick every other week. Endless days of playing LEGOs at home, without anyone interrupting my way of doing things - without anyone entering my world. School was torture for me. It wasn't about the other kids or having bad grades. It was about the structure that was set in place. I felt powerless. And I was stressed out permanently because I knew I had to be part of this system for a big chunk of my life."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"And this aspect of my being was present in every activity I pursued. I never built LEGO sets according to the manual. I just took the parts that were available to me and crafted my own adventure. I hated drawing things that already existed and playing songs out of a songbook. The russian school of playing the piano that was propagated by my teacher was driving me nuts. I quit after a few months and developed my own technique based on my favorite youtube tutorials."}]},{"type":"element","tag":"h3","props":{"id":"staying-sane-in-the-workplace"},"children":[{"type":"text","value":"Staying sane in the workplace"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Once I got out of school, I felt like I have been released from my shackles. Yes, there were still obstacles in front of me. But the cruicial difference was that they weren't mandatory. In university, I still got mentally exhausted from the way things were taught and how the academic construct worked as a whole. However, I wasn't forced to waste half of my day procrastinating in a class room. And this gave me hope for the future. Maybe adult life wasn't all that bad."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"And as it turns out, it isn't. I got a job in IT that gives me so much freedom of choice. Of course I have to deal with weekly deadlines and authority figures, but I can tackle any given task in the way I prefer. I have some saying in how things should be done and I have the chance to make suggestions to my superiors when I'm unhappy with a certain process. It's simply about coming to peace with the fact that any work environment will require a a tradeoff between self-actualization and conforming to a corporate way of doing things. If you can make that sacrifice, you will have a pleasant journey in most branches of business."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Looking back, the compulsory vest of the educational system probably has some right to exist. It sort of acts as a pair of training wheels for the average child. I assume that the vast majority of humans works best in a predefined enviroment. And outliers like me will have a hard time growing up."}]},{"type":"element","tag":"h3","props":{"id":"my-plans-for-the-future"},"children":[{"type":"text","value":"My plans for the future"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The only thing I haven't truly experienced yet is a complete detachment from the societal structure. A state in which the concept of core work hours doesn't exist. A reality in which I have total control over the structure of my day-to-day life. Every successful decision can be attributed to my judgement alone. And every failure is a product of my doing. I want to at least take a glimpse at what my body is truly capable of doing. Being the director of my own movie - the puppeteer pulling the strings of my existence."}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[{"id":"growing-up","depth":3,"text":"Growing up"},{"id":"staying-sane-in-the-workplace","depth":3,"text":"Staying sane in the workplace"},{"id":"my-plans-for-the-future","depth":3,"text":"My plans for the future"}]}},"_type":"markdown","_id":"content:blog:not-playing-by-the-rules.md","_source":"content","_file":"blog/not-playing-by-the-rules.md","_extension":"md"}]