{"_path":"/blog/on-my-relationship-with-painting","_dir":"blog","_draft":false,"_partial":false,"_locale":"","title":"On My Relationship With Painting","description":"The time has come to dissect an issue that has been plaguing my mind for far too long. A question that is very close to my heart. Perhaps too close to even make a rational assessment about what is truly going on behind my ego-tinted glasses. But I'm certain that if I don’t take action now, every day that goes by will just be another attempt to catch my own tail.","subtitle":"An attempt to reflect on my distorted relationship with the craft I so deeply admire.","author":"Kilian Kukelka","slug":"/on-my-relationship-with-painting","image":"on-my-relationship-with-painting","publishedDate":"2022-10-02","updatedAt":"2022-10-02","length":8,"wordCount":833,"body":{"type":"root","children":[{"type":"element","tag":"h3","props":{"id":"the-absence-of-fun"},"children":[{"type":"text","value":"The Absence of Fun"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The time has come to dissect an issue that has been plaguing my mind for far too long. A question that is very close to my heart. Perhaps too close to even make a rational assessment about what is truly going on behind my ego-tinted glasses. But I'm certain that if I don’t take action now, every day that goes by will just be another attempt to catch my own tail. Putting my thoughts and emotions down into words seems like the only valid approach to finally come to peace with my inner demon. The issue at hand, and the very topic I seek to deconstruct throughout writing this essay, is my relationship with painting. Somewhere along the way of acquiring this new skill of mine, I've somehow managed to turn this most sacred form of expression into an act of desperation. A misconfiguration of sorts, disabling me from experiencing the true nature of the craft."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The root cause for this crisis of mine is that no matter from which angle I choose to approach the subject, I simply cannot seem to find enjoyment in the activity. Sure, on the occasion there comes a moment that could be described as a feeling of proudness or a sense of accomplishment, yet they are spread so sparsely that I have a hard time coping with the dry spells that come in between. Hence, the artistic journey has become somewhat of an uphill battle to me, with the only thing keeping me going being the satisfaction I receive upon finishing a piece. Throughout the process itself, however, I either find myself in a state of complete apathy or at the beginning of a nervous breakdown. At first I thought this to be just the initial barrier one typically faces when picking up something new. Though after now two years of trial and error, I've come to the sobering realisation that my disconnectedness to the craft cannot be simply ascribed to a lack of proficiency or discipline, but emerges from the depths of my inner workings and the way I naturally tend to interface with the world."}]},{"type":"element","tag":"h3","props":{"id":"creative-deconstruction"},"children":[{"type":"text","value":"Creative Deconstruction"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"What exactly is it that pushes me to pick up my pen if I know for certain that all I'm going to be faced with is a barricade of boredom and exhaustion? Why is it that I need to force myself to paint, even though I romanticise the idea of being an artist? Writing it out like this is making me question the reason of why I embarked on this journey in the first place. Perhaps the aspiration of becoming this idealised version of myself simply isn't enough of an incitement to keep myself motivated on a long-term basis. It's the emphasis on \"becoming\" that seems to distract me from living in the present moment. A disoriented state of mind that is purely centered around the completion of egocentric objectives, leaving no room to fathom the beauty of the creative process."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"If I'm being honest, not a single painting of mine has been started out of necessity to express myself, nor has it served me as an outlet to work through my emotions. That isn’t to say one cannot create in absence of aforementioned reasons. It’s just that for me personally, not having an inherent urge to devote myself to the matter on a day-to-day basis let’s painting become a chore rather than something I look forward to do. What has emerged is a state of disorientation. A toxic cycle that, through its deceptive prospects of fame and success, manages to keep me stuck in place. I genuinely believe, however, that the given situation is not a product of a lack of discipline and that vigorously trying to rewire myself just for the off-chance of finding enjoyment is not to be considered an appropriate response to the dilemma I’m facing. That is because in virtually every other aspect of my life, these character traits of mine give me an edge I don’t want to miss. More often than not, I truly appreciate and welcome the way my brain tends to parse and process my surroundings. My mind is, and always has been, a captive to short-term gratification. Even if that means that my pursuits are primarily guided by shortsighted motives, it is a trait that I don’t want to sacrifice."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Hence, I find myself at a crossroads of either trying to reframe my approach to painting as a whole or to discover a more fitting creative outlet all together. No matter the direction I’m going next, my number one priority is to ensure that I won’t fall into my old patterns of behaviour. To not compromise on my new set goal of finding an activity I enjoy doing regardless of its potential yield or social standing. A process that keeps me stimulated and entertained over long stretches of time, without finding myself in a state of defeat after just a few minutes of engagement."}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[{"id":"the-absence-of-fun","depth":3,"text":"The Absence of Fun"},{"id":"creative-deconstruction","depth":3,"text":"Creative Deconstruction"}]}},"_type":"markdown","_id":"content:blog:on-my-relationship-with-painting.md","_source":"content","_file":"blog/on-my-relationship-with-painting.md","_stem":"blog/on-my-relationship-with-painting","_extension":"md"}