{"_path":"/blog/direction-through-comparison","_dir":"blog","_draft":false,"_partial":false,"_locale":"","_empty":false,"title":"Direction Through Comparison","description":"A vast majority of my friends - me included - have reached this certain point in life, where direction seems to be a key factor for our development. The mid 20s are slowly presenting themself as a broken compass, leaving you aimless on your journey to your next destination. What's next to come?","subtitle":"On how to reverse engineer your role models","author":"Kilian Kukelka","slug":"/direction-through-comparison","date":"2020-08-02","updatedAt":"2020-08-02","length":5,"body":{"type":"root","children":[{"type":"element","tag":"h3","props":{"id":"the-broken-compass"},"children":[{"type":"text","value":"The broken compass"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"A vast majority of my friends - me included - have reached this certain point in life, where direction seems to be a key factor for our development. The mid 20s are slowly presenting themself as a broken compass, leaving you aimless on your journey to your next destination. We have had our first peaks into the dark abyss that society calls adulthood and got battered by the illusion of finding fulfillment in a corperate structure. What we are left with is \"some\" understanding of what we may want and definitely don't want in life. But what's the next step?"}]},{"type":"element","tag":"h3","props":{"id":"observe-what-you-like"},"children":[{"type":"text","value":"Observe what you like"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"What I realized throughout the last few years of exploring my personality is that I share some very prominent features with a lot of people I admire. I really love to obsess over my role models. I consume every bit of information about them that is out there. Listening to hours of interviews. Watching documentaries. Reading forum posts about them. To my surprise, the individuals I can really, really relate to all fall into the same fields of expertise (either illustration or anything cs related for the most part). Initially I would have guessed that it would be an even distribution between all my interests."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Especially people in the music industry have let me down. In most cases, they don't seem to put as much thought into their craft as I would have expected. Or rather, as I would have wanted them to. I cannot stand listening to them explain the process behing their latest album. But their music. Oh my. Their music sends shivers down my spine. What is missing here. Is it the lack of analytical thinking on their part that is letting me down? Who knows. I guess when you strife for perfection in everything you do, you cannot rely on intuition alone. And this is one essential aspect of making music that blocks the inner workings of my brain. Well, there are ways to make music analytically. But its just not what I intend to do. It's funny that I'm aware of what keeps me from finishing any of my songs, but I'm unable to act on it. Let's get back to my initial argument."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"So on the other hand, we have illustrators and concept artists. I can listen to them talk for hours at a time. Steven Zapata, Modern Day James, Jason Brubaker, I can go on and on. You know that moment, when every line that comes out of someone's mouth makes sense. Every syllable tingles your synapses. I replay the same sentence over and over again. It's music to my ears.\nThere is so much pain and suffering that goes into their work. So much time they spend on their craft. Some even going for 16 hour work days (at least thats what some of them claim). And I really admire these guys. I actively try to be like them. Not copying traits of their personality, but their perspective on life. Which seems to be all about enjoying the process. Not thinking long-term, nor short-term. Just enjoying the moment. Call me a spiritual nutjob, but I can see value in that. I can see certain overlaps with the philosophical school of stoicism here, which teaches you not to act upon the fear of pain or the desire for pleasure. You should rather accept your current situation as is, which is exactly what many artists seem to strive after."}]},{"type":"element","tag":"h3","props":{"id":"extract"},"children":[{"type":"text","value":"Extract"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"What can we now accomplish with this insight. Lets try to cast all these trains of thought into some kind of mold - call it a hypothesis if you will. My driving assumption behind this process is that people who pursuit a specific profession probably went through similar challenges in life. They have experienced a specific kind of upbringing and presumably share a certain outlook on life. They already went through the same thought loops and came to important conclusions that my disoriented self soughs after. To stretch this assumption even further, my guess is that events in their early childhood and teenage years led such groups to have overlapping character traits and behavioural patterns. They went on to accumulate specific knowledge and interests that turned out to be especially useful in the profession they ended up in. Of course its hard to retroactively say if one's skills were aquired due to the desire to succeed in a certain profession, or if same profession just organically played into one's strenghts. Lets assume it was a combination of both."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Now extract what these individuals have learned on their journeys, which should share similar keypoints with the path you are currently on. Don't spend too much time overthinking every single action you could undertake to get out of your misery. Instead, try to incorporate some of these insights into your own philosophy. Approaches that have already shown its magic in the lifes of your role models. Change up your workflow and way of living and see what sticks. Thoughts can never unveil the actual sensation of actions. And actions are what teaches you about your shortcomings, eventually bringing you closer to your true mission in life."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Well... This piece was all over the place. I hope I can produce more structured and coherent texts in the future. Until then you have to cope with my ramblings. But even if just one sentence managed to set your brain in motion, I think it was worth the journey."}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[{"id":"the-broken-compass","depth":3,"text":"The broken compass"},{"id":"observe-what-you-like","depth":3,"text":"Observe what you like"},{"id":"extract","depth":3,"text":"Extract"}]}},"_type":"markdown","_id":"content:blog:direction-through-comparison.md","_source":"content","_file":"blog/direction-through-comparison.md","_extension":"md"}