{"_path":"/blog/resisting-the-dark-arts-of-big-sugar","_dir":"blog","_draft":false,"_partial":false,"_locale":"","_empty":false,"title":"Resisting The Dark Arts of Big Sugar","description":"Dear creator of the universe, what vicious notion has driven you to bestow us with this plant that is the cocoa tree. Looking at past inventions of yours, you must have been very well aware of the consequences your actions might entail.","subtitle":"On my lifelong struggle with the bittersweet muse","author":"Kilian Kukelka","slug":"/resisting-the-dark-arts-of-big-sugar","image":"resisting-the-dark-arts-of-big-sugar","alt":"Shelf full of chocolate bars","attribution":"Kilian Kukelka","date":"2023-05-06","updatedAt":"2023-05-06","length":9,"wordCount":1747,"body":{"type":"root","children":[{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Dear creator of the universe, what vicious notion has driven you to bestow us with this plant that is the cocoa tree. Looking at past inventions of yours, you must have been very well aware of the consequences your actions might entail. Once again, my species’ innate tendency to favour short-term pleasure has set us up to be particularly vulnerable to the addictive properties that lie dormant in its beans. It comes as no surprise that you have chosen for it to be concealed deep within the rainforest’s verdant embrace. Yet even your all-knowing wisdom was unable to foresee mankind's insatiable appetite for more, setting in motion the relentless pursuit to exploit the gift that was given to us."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Fast forward to the here and now, the once innocent fruits of your creation have been taken hostage by the profit-hungry entities that make up the sugar industrial complex. Like with so many other consumable goods that let us temporarily alter our perceived state of being, the opportunistic minds of the corporate world couldn’t help themselves but to start profiting off of our unfortunate evolutionary trait. And it‘s the ease with which they are able to enslave us, that makes it so frustrating to watch our growing inability to cope with the malicious practices found in modern consumer markets. A development that often causes not only our relationship, but our every interaction with food to be a gauntlet of emotions instead of the rewarding experience nature intended it to be."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The constant access thereof, a condition our ancestors would have welcomed with open hands, now puts us in the awkward position of having to actively restrain our primal instincts from making us ingest piles of sweet tasting, high-caloric landfill material. It is rather ironic how the very mechanisms that enabled humanity to flourish are now deliberately weaponized against it, all to impress some corporate suits in the next quarterly earnings call."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Makes you wonder how we got this far in the first place. When the same organ that can come up with the concept of a rocket engine will gladly throw out its last bit of dignity just to get a taste of Ritter Sport‘s newly released Crispy Banana flavor. Apparently it’s as easy as mixing the ground cocoa seeds with a bunch of milk-based derivatives and the crystallized nectar of the sugarcane for them to obtain the key to our hearts."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"By flooding the shelves with sheer endless variations of this good, products of all shapes and colors and flavors and sizes, catered to every age group and lifestyle and season of the year, the modern consumer is almost held at gunpoint whenever they are forced to pass through the vast and enticing candy aisle on their way to the checkout. Be it as a gift for a loved one or as a cure for one of those moody days, it’s allure has captivated the hearts and souls of most everyone around us. Even myself, a person I‘d consider rather disciplined and thoughtful in their actions, occasionally will give into the seductive whispers of the bittersweet muse."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"One manufacturer in particular, a small German brand by the name of Meybona, has managed to craft a blend that has captivated my taste buds from the very first bite. Despite its pretty high cocoa content of around 85%, typically resulting in a taste profile consisting mostly of bitter and earthy notes, the bar not only manages to pull off the soft creamy texture of its milk-based siblings, but also overwhelmed me with its surprisingly sweet aroma. So much so that it had me check the food label twice. I couldn’t fathom how this thing was supposed to contain only 14 grams of sugar, but there was no trickery to be found. Just 5 simple ingredients, consisting of sugar, vanilla and various cocoa solids, with no trace of artificial sweeteners in sight. A showcase of true craftsmanship."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Just this Saturday I‘ve devoured one of them in a record time of 3 minutes and 25 seconds. Perhaps I should bring to your attention that I didn’t try to set a new record (low) for myself here. It’s that my body has developed this weird talent to almost accurately synchronize the time it requires to ingest a given meal with the exact episode length of whatever tv show I happen to watch at that moment. The 3 minutes and 25 seconds was what’s left of an episode of Southpark I had started watching earlier that day. Currently catching up on the latest season. I have to say that I’m quite disappointed by the lackluster content of recent seasons. What I used to consider the pinnacle of thought-provoking satire and social commentary, nowadays often fails to live up to its former glory, effectively turning the show into nothing more than a lazy recapitulation of current events.\nAnywho, thanks to my inner demons, I couldn’t just watch the rest of the episode like a normal person would do. No, I needed to superset the given visual experience with yet another hedonistic stimulus. My rational is being hijacked by my insatiable cravings for that sweet-tasting sensation, despite me being fully aware of the ramifications such actions will have on my overall well-being. The slightly frantic state it leaves me in, the inevitable effect it will have one my sleep hygiene, the metabolic repercussions of consuming large amounts of highly refined sugar and saturated fats. All of this for a few minutes’ worth of pleasure."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"It’s fascinating to observe what lengths my body is willing to go to just so it can experience a bunch of glucose molecules rushing through its bloodstream, reminiscent of Hollywood’s depiction of a heroine addict looking for his next fix. You’d think I was exaggerating here, but during my first few years at university, I genuinely struggled to maintain a grip on my self-control. To a point at which 3 bars of chocolate a day had become the norm. Even if it was way past closing time of any nearby convenience store, I‘d always find a way to get my daily dose of sugar. Whether that meant stopping by some random gas station in the middle of nowhere (mind you I don’t own a car), or making the pilgrimage to a 24/7 supermarket at the nearest train station. None of which are locations you want to find yourself at in the middle of the night. The scenery, composed mostly of functional alcoholics, stranded tourists and pale-skinned night shift workers, was sorrowing at best. That didn’t stop me, however, from becoming a regular visitor of said establishments. On a good day, I settled with 2 bars of Milka, with at least one of them having to be the flavor featuring Lefèvre-Utile biscuits inside. The one with the prominent red-coloured wave on its packaging. If I had to choose, I‘d make it my contestant for the greatest food brand collaboration in existence. 87 grams of perfection. My favorite part was to nibble off the chocolate that surrounded each of the buscuit pieces. Saving up the salty parts for last gave me the needed palette cleanse to not get fatigued by the tidal wave of sweetness that had just swept through my mouth."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"What was initially thought of as a way of rewarding myself for surviving yet another day in the shit show that is the academic system, gradually evolved into a toxic habit that seized control of my daily life. While I perfectly well understood that my excessive consumption habits would eventually take a toll on my well-being, I was past the point at which I could still bargain with my inner voice. It took a series of rather serious health complications for me to muster enough willpower to finally break free from my compulsive behaviour. And although I emerged victorious from this battle, my sweet tooth has yet to be defeated."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"No matter which sin of the culinary world I‘m up against - be it sugary treats, salty snacks, or deep-fried delicacies - the common thread they share is the way in which they interfere with my reward mechanisms. It feels like when faced with situations that guarantee some sort of immediate relieve, the human mind is almost programmed to indulge in the temptation. When looking at the environment our ancestors had to survive in, roaming the planes of the South African wetlands, it stands to reason why we developed such tendencies in the first place. Back then, food was a necessity, rather than the hedonistic activity it has become today. One had to seize every opportunity to obtain sustenance, as scarcity and uncertainty were ever-present. But with the arrival of the Industrial Age, the invention of ever more capable machinery and ultimately the advancements in food manufacturing and preservation, humanity has effectively outpaced the speed of evolution in a matter of centuries. Imposed upon our primal instincts is now the insurmountable task of helping us steer through an environment of overabundance."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Though it should be noted, that this constant availability isn't harmful per se. It was the introduction of highly processed, calorie dense food products into our diet, that has put society into disarray. I know what you might be thinking right now, but i ask you to not let your emotions cloud your judgement. Pointing your finger at the next best industry giant won’t aid you in pulling yourself out of your misery, as the suffering that plagues you is entirely self-inflicted. At its core, the modern culinary landscape is nothing more than a reflection of the collective demand. If you ever wondered why something like Hershey‘s giant 5 pound bar exists, it is because someone is willing to pay money for it. That’s just how consumer markets tend to work. Way more interesting to decipher are the motivational factors behind such purchases, which are rooted deeply in the way in which Western society puts consumerism above all. A mental construct that has been fed to the masses since the 18th century, as a means to counteract the overproduction of goods. Ever since, our day-to-day life and social norms have been meticulously tailored to fit this given narrative, making us utilize the act of consumption as a coping mechanism to fill the void that everyday life leaves us with. Wouldn't it be wonderful if simply being conscious of this predicament was enough to break free from it? Yet here I stand, with a bar of chocolate in my shopping bag."}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[]}},"_type":"markdown","_id":"content:blog:resisting-the-dark-arts-of-big-sugar.md","_source":"content","_file":"blog/resisting-the-dark-arts-of-big-sugar.md","_extension":"md"}