[{"data":1,"prerenderedAt":105},["Reactive",2],{"/blog/welcome-the-end":3,"content-query-XYr9TqsUAY":70},{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":7,"title":8,"description":9,"subtitle":10,"author":11,"slug":12,"publishedDate":13,"updatedAt":13,"length":14,"wordCount":15,"body":16,"_type":65,"_id":66,"_source":67,"_file":68,"_extension":69},"/blog/welcome-the-end","blog",false,"","Welcome the End","In times of social uproar, economic downturns and seemingly daily environmental disasters, it is getting increasingly harder for me to keep a healthy mindset.","The value of friendship in a burning world","Kilian Kukelka","/welcome-the-end","2020-09-13",3,564,{"type":17,"children":18,"toc":60},"root",[19,27,32,39,44,49,55],{"type":20,"tag":21,"props":22,"children":23},"element","p",{},[24],{"type":25,"value":26},"text","In times of social uproar, economic downturns and seemingly daily environmental disasters, it is getting increasingly harder for me to keep a healthy mindset. All the hours I spent soul searching in the last few years seem to have gone to waste. Just when you think you have finally figured it out, your efforts suddenly lose all their meaning. What's the point of trying anymore? What's the point of developing your skills? When in the next few years, the way we treated nature in the past is gonna catch up with us.",{"type":20,"tag":21,"props":28,"children":29},{},[30],{"type":25,"value":31},"We have grown accustomed to our wasteful way of living, and no disruption is gonna change that behaviour in the near future. Once the option has been established, we have crossed the point of no return. Can you imagine the pushback when there are suddenly no bananas available anymore? When there is no imported coffee from across the globe on the shelves? I for one would be more than happy with such changes. But the vast majority of people doesn't seem to recognise the enormous carbon output it takes to transfer the ecuadorian chocolate nibs into their breakfast bowl (which itself was probably manufactured in a third world country of your choice).",{"type":20,"tag":33,"props":34,"children":36},"h3",{"id":35},"the-sad-realisation",[37],{"type":25,"value":38},"The sad realisation",{"type":20,"tag":21,"props":40,"children":41},{},[42],{"type":25,"value":43},"What is truly sad is that we actually have figured it out. There is a way of doing this sustainably. During this pandemic, there were moments when I thought we would have finally learned our lesson. But I was wrong. Everything is back to normal. We have lost some people on the way. But there's no sign of stopping the machinery of capitalism. There is a voice inside of me that actually wants to see society crumble - to witness the downfall evoked by our wrongdoings. If there's not gonna be a revelation of any superior motive to all of this, I sincerely believe we have set our course towards the abyss.",{"type":20,"tag":21,"props":45,"children":46},{},[47],{"type":25,"value":48},"What's even more disappointing is the fact that I feel powerless in regards to the current situation. When there are entire corporations rooting for the wrong team, what power do I have as an individual? You are shouting against a brick wall. One may look at social media as a viable solution to amplify your voice, but even here the playing field is not even. You will eventually drown in a pool of meaningless content and purposely spread disinformation. It isn't about the message anymore, the real economic value is attention. And that's what our vision is missing. We cannot feed the program - it therefore cannot be catered to an audience of short-term thinkers and zombies of the status quo.",{"type":20,"tag":33,"props":50,"children":52},{"id":51},"finding-relief-in-the-chaos",[53],{"type":25,"value":54},"Finding relief in the chaos",{"type":20,"tag":21,"props":56,"children":57},{},[58],{"type":25,"value":59},"One a more positive note, 2020 has taught me a lot about what is truly valuable in life. How is a digital number stored on a bank server gonna help you with your inner demons? How is a new flatscreen TV gonna soothe your existential dread? What are we left with when shit hits the fan? Humans. While I was trapped in the rat race, it was my fellow human beings that I left out of the picture. The joy of sharing, talking or just simply sitting right next to your best friend. That's when you realise that we are all passengers on the same train. Yes, our destination may be unknown. But we have each other to make it there.",{"title":7,"searchDepth":61,"depth":61,"links":62},2,[63,64],{"id":35,"depth":14,"text":38},{"id":51,"depth":14,"text":54},"markdown","content:blog:welcome-the-end.md","content","blog/welcome-the-end.md","md",{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":7,"title":8,"description":9,"subtitle":10,"author":11,"slug":12,"publishedDate":13,"updatedAt":13,"length":14,"wordCount":15,"body":71,"_type":65,"_id":66,"_source":67,"_file":68,"_extension":69},{"type":17,"children":72,"toc":101},[73,77,81,85,89,93,97],{"type":20,"tag":21,"props":74,"children":75},{},[76],{"type":25,"value":26},{"type":20,"tag":21,"props":78,"children":79},{},[80],{"type":25,"value":31},{"type":20,"tag":33,"props":82,"children":83},{"id":35},[84],{"type":25,"value":38},{"type":20,"tag":21,"props":86,"children":87},{},[88],{"type":25,"value":43},{"type":20,"tag":21,"props":90,"children":91},{},[92],{"type":25,"value":48},{"type":20,"tag":33,"props":94,"children":95},{"id":51},[96],{"type":25,"value":54},{"type":20,"tag":21,"props":98,"children":99},{},[100],{"type":25,"value":59},{"title":7,"searchDepth":61,"depth":61,"links":102},[103,104],{"id":35,"depth":14,"text":38},{"id":51,"depth":14,"text":54},1699973178368]